{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "import sys\n",
    "import re\n",
    "sys.path.append('../../code/')\n",
    "from utils.preprocess import read_json\n",
    "from Ques_pair import Ques_pair, Type"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "ref_file = read_json(\"/Users/mengshima/Downloads/mt5_ling_11.json\")\n",
    "pred_file = read_json(\"/Users/mengshima/Downloads/mt5_11.json\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "ref_ques_list = [ref for ref in ref_file[\"questions\"]]\n",
    "pred_ques_list = [pred for pred in pred_file[\"questions\"]]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "id: 99\n",
      "question: What is the time zone of Salt Lake City?<pad>What is the time zone of Salt Lake City ?<pad>PRON AUX DET NOUN NOUN ADP PROPN PROPN PROPN PUNCT<pad>attr ROOT det compound nsubj prep compound compound pobj punct<pad>2 1 3 3 2 3 6 5 4 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q187893 wdt:P421 ?uri }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q220 wdt:P421 ?uri } \n",
      "ref_answer:\n",
      " [{'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q5762'}}]\n",
      "pred_answer:\n",
      " [{'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q6655'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q6723'}}]\n",
      "\n",
      "\n",
      "id: 98\n",
      "question: Who killed Caesar?<pad>Who killed Caesar ?<pad>PRON VERB PROPN PUNCT<pad>nsubj ROOT dobj punct<pad>2 1 2 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q692 wdt:P570 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q596 wdt:P61 ?uri . } \n",
      "ref_answer:\n",
      " [{'uri': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime', 'type': 'literal', 'value': '1616-05-03T00:00:00Z'}}]\n",
      "pred_answer:\n",
      " [{'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q14280'}}]\n",
      "\n",
      "\n",
      "id: 86\n",
      "question: What is the highest mountain in Germany?<pad>What is the highest mountain in Germany ?<pad>PRON AUX DET ADJ NOUN ADP PROPN PUNCT<pad>attr ROOT det amod nsubj prep pobj punct<pad>2 1 3 3 2 3 4 2\n",
      "ref sparql: SELECT ?res WHERE { ?res wdt:P31 wd:Q8502 . ?res wdt:P131+ wd:Q1202 . ?res wdt:P2044 ?height . } ORDER BY DESC(?height) LIMIT 1\n",
      "pred sparql: SELECT ?res WHERE { ?res wdt:P31 wd:Q8502 . ?res wdt:P131+ wd:Q1202 . ?res wdt:P2044 ?height . } ORDER BY DESC( ?height) LIMIT 1\n",
      "ref_answer:\n",
      " [{'res': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q164561'}}]\n",
      "pred_answer:\n",
      " [{'res': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q164561'}}]\n",
      "\n",
      "\n",
      "id: 84\n",
      "question: Which American presidents were in office during the Vietnam War?<pad>Which American presidents were in office during the Vietnam War ?<pad>DET ADJ NOUN AUX ADP NOUN ADP DET PROPN PROPN PUNCT<pad>det amod nsubj ROOT prep pobj prep det compound pobj punct<pad>3 3 2 1 2 3 2 4 4 3 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P39 wd:Q9696 ; wdt:P20 wd:Q20 . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q11817 wdt:P607 ?uri . } \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q26013'}}]\n",
      "\n",
      "\n",
      "id: 81\n",
      "question: Butch Otter is the governor of which U.S. state?<pad>Butch Otter is the governor of which U.S. state ?<pad>PROPN PROPN AUX DET NOUN ADP PRON PROPN NOUN PUNCT<pad>compound nsubj ROOT det attr prep pobj compound relcl punct<pad>3 2 1 3 2 4 5 4 3 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q4970706 wdt:P6 ?uri . } \n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q983650 wdt:P131+ ?uri . ?uri wdt:P31 wd:Q35657 . } \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q1603'}}]\n",
      "\n",
      "\n"
     ]
    }
   ],
   "source": [
    "n = 5\n",
    "for ref, pred in zip(ref_ques_list[:n], pred_ques_list[:n]):\n",
    "    ques_pair = Ques_pair(ref, pred)\n",
    "    ques_pair.print(print_answer=True)\n",
    "    print()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "id: 99\n",
      "question: What is the time zone of Salt Lake City?<pad>What is the time zone of Salt Lake City ?<pad>PRON AUX DET NOUN NOUN ADP PROPN PROPN PROPN PUNCT<pad>attr ROOT det compound nsubj prep compound compound pobj punct<pad>2 1 3 3 2 3 6 5 4 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q187893 wdt:P421 ?uri }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q220 wdt:P421 ?uri } \n",
      "\n",
      "id: 98\n",
      "question: Who killed Caesar?<pad>Who killed Caesar ?<pad>PRON VERB PROPN PUNCT<pad>nsubj ROOT dobj punct<pad>2 1 2 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q692 wdt:P570 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q596 wdt:P61 ?uri . } \n",
      "\n",
      "id: 86\n",
      "question: What is the highest mountain in Germany?<pad>What is the highest mountain in Germany ?<pad>PRON AUX DET ADJ NOUN ADP PROPN PUNCT<pad>attr ROOT det amod nsubj prep pobj punct<pad>2 1 3 3 2 3 4 2\n",
      "ref sparql: SELECT ?res WHERE { ?res wdt:P31 wd:Q8502 . ?res wdt:P131+ wd:Q1202 . ?res wdt:P2044 ?height . } ORDER BY DESC(?height) LIMIT 1\n",
      "pred sparql: SELECT ?res WHERE { ?res wdt:P31 wd:Q8502 . ?res wdt:P131+ wd:Q1202 . ?res wdt:P2044 ?height . } ORDER BY DESC( ?height) LIMIT 1\n",
      "\n",
      "id: 84\n",
      "question: Which American presidents were in office during the Vietnam War?<pad>Which American presidents were in office during the Vietnam War ?<pad>DET ADJ NOUN AUX ADP NOUN ADP DET PROPN PROPN PUNCT<pad>det amod nsubj ROOT prep pobj prep det compound pobj punct<pad>3 3 2 1 2 3 2 4 4 3 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P39 wd:Q9696 ; wdt:P20 wd:Q20 . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q11817 wdt:P607 ?uri . } \n",
      "\n",
      "id: 81\n",
      "question: Butch Otter is the governor of which U.S. state?<pad>Butch Otter is the governor of which U.S. state ?<pad>PROPN PROPN AUX DET NOUN ADP PRON PROPN NOUN PUNCT<pad>compound nsubj ROOT det attr prep pobj compound relcl punct<pad>3 2 1 3 2 4 5 4 3 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q4970706 wdt:P6 ?uri . } \n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q983650 wdt:P131+ ?uri . ?uri wdt:P31 wd:Q35657 . } \n",
      "\n",
      "id: 66\n",
      "question: Which artists were born on the same date as Rachel Stevens?<pad>Which artists were born on the same date as Rachel Stevens ?<pad>DET NOUN AUX VERB ADP DET ADJ NOUN ADP PROPN PROPN PUNCT<pad>det nsubjpass auxpass ROOT prep det amod pobj prep compound pobj punct<pad>3 2 2 1 2 4 4 3 4 6 5 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q241665 wdt:P569 ?date . BIND(YEAR(?date) as ?year) }\n",
      "pred sparql: SELECT DISTINCT ?year WHERE { wd:Q241665 wdt:P569 ?date . BIND(YEAR( ?date) as ?year) } \n",
      "\n",
      "id: 64\n",
      "question: What is the profession of Frank Herbert?<pad>What is the profession of Frank Herbert ?<pad>PRON AUX DET NOUN ADP PROPN PROPN PUNCT<pad>attr ROOT det nsubj prep compound pobj punct<pad>2 1 3 2 3 5 4 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q319308 wdt:P166 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q937 wdt:P184 ?uri } \n",
      "\n",
      "id: 56\n",
      "question: How many seats does the home stadium of FC Porto have?<pad>How many seats does the home stadium of FC Porto have ?<pad>SCONJ ADJ NOUN AUX DET NOUN NOUN ADP PROPN PROPN VERB PUNCT<pad>advmod amod nsubj aux det compound nsubj prep compound pobj ROOT punct<pad>5 4 3 2 3 3 2 3 5 4 1 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q483110 wdt:P131 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q58226 wdt:P2044 ?uri . } \n",
      "\n",
      "id: 49\n",
      "question: Which frequent flyer program has the most airlines?<pad>Which frequent flyer program has the most airlines ?<pad>DET ADJ NOUN NOUN VERB DET ADJ NOUN PUNCT<pad>det amod compound nsubj ROOT det amod dobj punct<pad>3 3 3 2 1 3 3 2 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q46970 } ?uri wdt:P106 ?uri . } GROUP BY ?uri ORDER BY DESC(COUNT(DISTINCT ?uri) LIMIT 1\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q46970 } GROUP BY ?uri ORDER BY DESC(COUNT(DISTINCT ?uri) LIMIT 1\n",
      "\n",
      "id: 44\n",
      "question: Which European countries have a constitutional monarchy?<pad>Which European countries have a constitutional monarchy ?<pad>DET ADJ NOUN VERB DET ADJ NOUN PUNCT<pad>det amod nsubj ROOT det amod dobj punct<pad>3 3 2 1 3 3 2 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q7278 ; wdt:P17 wd:Q41 ; wdt:P1142 wd:Q3781399 . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q6256 . ?uri wdt:P38 wd:Q4916 . } \n",
      "\n",
      "id: 42\n",
      "question: Which countries have places with more than two caves?<pad>Which countries have places with more than two caves ?<pad>DET NOUN VERB NOUN ADP ADJ ADP NUM NOUN PUNCT<pad>det nsubj ROOT dobj prep amod quantmod nummod pobj punct<pad>3 2 1 2 3 6 6 5 4 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q6256 . ?uri wdt:P37 ?lake . ?uri wdt:P31 wd:Q5287 . } GROUP BY ?uri HAVING(COUNT(?lake)>\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q4022 . ?uri p_P2043 ?stmnode . ?stmnode psv_P2043 ?valuenode . ?valuenode wikibase_quantityAmount ?length . ?valuenode wikibase_quantityUnit ?unit . ?valuenode wikibase_quantityLowerBound ?lowerbound . ?valuenode wikibase_quantityUpperBound ?upperbound .\n",
      "\n",
      "id: 4\n",
      "question: Which airports are located in California, USA?<pad>Which airports are located in California , USA ?<pad>DET NOUN AUX VERB ADP PROPN PUNCT PROPN PUNCT<pad>det nsubjpass auxpass ROOT prep pobj punct appos punct<pad>3 2 2 1 2 3 4 4 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q168383 wdt:P31 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q51747 wdt:P113 ?uri . } \n",
      "\n",
      "id: 31\n",
      "question: Who is the mayor of Berlin?<pad>Who is the mayor of Berlin ?<pad>PRON AUX DET NOUN ADP PROPN PUNCT<pad>attr ROOT det nsubj prep pobj punct<pad>2 1 3 2 3 4 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q34370 wdt:P6 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q34370 wdt:P6 ?uri . } \n",
      "\n",
      "id: 29\n",
      "question: Which countries in the European Union adopted the Euro?<pad>Which countries in the European Union adopted the Euro ?<pad>DET NOUN ADP DET PROPN PROPN VERB DET PROPN PUNCT<pad>det nsubj prep det compound pobj ROOT det dobj punct<pad>3 2 3 5 5 4 1 3 2 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q6256 . ?uri wdt:P38 wd:Q4916 . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q6256 . ?uri wdt:P38 wd:Q4916 . } \n",
      "\n",
      "id: 68\n",
      "question: Which country was Bill Gates born in?<pad>Which country was Bill Gates born in ?<pad>DET NOUN AUX PROPN PROPN VERB ADP PUNCT<pad>det nsubj ROOT compound attr acl prep punct<pad>3 2 1 3 2 3 4 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q40912 wdt:P19 ?uri }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q9696 wdt:P20/wdt:P131 ?uri . ?uri wdt:P31 wd:Q515 . } \n",
      "\n",
      "id: 22\n",
      "question: How many grand-children did Jacques Cousteau have?<pad>How many grand - children did Jacques Cousteau have ?<pad>SCONJ ADJ ADJ PUNCT NOUN AUX PROPN PROPN VERB PUNCT<pad>advmod amod amod punct dobj aux compound nsubj ROOT punct<pad>4 3 3 3 2 2 3 2 1 2\n",
      "ref sparql: SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE { wd:Q34969 wdt:P40 ?uri . }\n",
      "pred sparql: SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { wd:Q43874 wdt:P40 ?uri . } \n",
      "\n",
      "id: 214\n",
      "question: Give me all professional skateboarders from Sweden.<pad>Give me all professional skateboarders from Sweden .<pad>VERB PRON DET ADJ NOUN ADP PROPN PUNCT<pad>ROOT dative det amod dobj prep pobj punct<pad>1 2 3 3 2 2 3 2\n",
      "ref sparql: SELECT ?uri WHERE { ?uri wdt:P106 wd:Q10841764 ; wdt:P19 wd:Q64 . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q82955 ; wdt:P19 wd:Q649 . } \n",
      "\n",
      "id: 210\n",
      "question: Which monarchs of the United Kingdom were married to a German?<pad>Which monarchs of the United Kingdom were married to a German ?<pad>DET NOUN ADP DET PROPN PROPN AUX ADJ ADP DET PROPN PUNCT<pad>det nsubj prep det compound pobj ROOT acomp prep det pobj punct<pad>3 2 3 5 5 4 1 2 3 5 4 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q116 ; wdt:P26 ?spouse . ?spouse wdt:P27 wd:Q183 . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q116 ; wdt:P26 ?spouse . ?spouse wdt:P27 wd:Q183 . } \n",
      "\n",
      "id: 199\n",
      "question: Give me all Argentine films.<pad>Give me all Argentine films .<pad>VERB PRON DET ADJ NOUN PUNCT<pad>ROOT dative det amod dobj punct<pad>1 2 3 3 2 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q11424 ; wdt:P162 wd:Q193668 ; wdt:P495 wd:Q29 ; wdt:P161 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q11424 . ?uri wdt:P31 ?type ; wdt:P495 wd:Q35 . } \n",
      "\n",
      "id: 203\n",
      "question: How did Michael Jackson die?<pad>How did Michael Jackson die ?<pad>SCONJ AUX PROPN PROPN VERB PUNCT<pad>advmod aux compound nsubj ROOT punct<pad>2 2 3 2 1 2\n",
      "ref sparql: SELECT DISTINCT ?o1 WHERE { wd:Q4977246 wdt:P509 ?o1 . }\n",
      "pred sparql: SELECT DISTINCT ?val WHERE { wd:Q41421 wdt:P2048 ?val . } \n",
      "\n",
      "id: 197\n",
      "question: Which U.S. state has been admitted latest?<pad>Which U.S. state has been admitted latest ?<pad>DET PROPN NOUN AUX AUX VERB ADJ PUNCT<pad>det compound nsubjpass aux auxpass ROOT advmod punct<pad>3 3 2 2 2 1 2 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q35657 ; wdt:P2046 ?area ; wdt:P1082 ?population . BIND((?population/?area) AS ?density) . } ORDER BY DESC(?density) LIMIT 1\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q194188 ; wdt:P571 ?date . } ORDER BY DESC( ?date) LIMIT 1\n",
      "\n",
      "id: 196\n",
      "question: Which classes does the Millepede belong to?<pad>Which classes does the Millepede belong to ?<pad>DET NOUN AUX DET PROPN VERB ADP PUNCT<pad>det pobj aux det nsubj ROOT prep punct<pad>4 3 2 3 2 1 2 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q7378 wdt:P279 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q7378 wdt:P279 ?uri . } \n",
      "\n",
      "id: 188\n",
      "question: Give me the homepage of Forbes.<pad>Give me the homepage of Forbes .<pad>VERB PRON DET NOUN ADP PROPN PUNCT<pad>ROOT dative det dobj prep pobj punct<pad>1 2 3 2 3 4 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q25161472 wdt:P98 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q25161472 wdt:P98 ?uri . } \n",
      "\n",
      "id: 187\n",
      "question: Who is the husband of Amanda Palmer?<pad>Who is the husband of Amanda Palmer ?<pad>PRON AUX DET NOUN ADP PROPN PROPN PUNCT<pad>attr ROOT det nsubj prep compound pobj punct<pad>2 1 3 2 3 5 4 2\n",
      "ref sparql: SELECT DISTINCT ?o1 WHERE { wd:Q303 wdt:P26 wd:Q303 . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q43247 wdt:P40 ?child . ?child wdt:P26 ?uri . } \n",
      "\n",
      "id: 176\n",
      "question: Who painted The Storm on the Sea of Galilee?<pad>Who painted The Storm on the Sea of Galilee ?<pad>PRON VERB DET NOUN ADP DET PROPN ADP PROPN PUNCT<pad>nsubj ROOT det dobj prep det pobj prep pobj punct<pad>2 1 3 2 2 4 3 4 5 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q7378 wdt:P737 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q1163227 wdt:P50 ?uri . } \n",
      "\n",
      "id: 62\n",
      "question: What is the highest place of Karakoram?<pad>What is the highest place of Karakoram ?<pad>PRON AUX DET ADJ NOUN ADP PROPN PUNCT<pad>attr ROOT det amod nsubj prep pobj punct<pad>2 1 3 3 2 3 4 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q35600 wdt:P610 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q35600 wdt:P610 ?uri . } \n",
      "\n",
      "id: 173\n",
      "question: When did Finland join the EU?<pad>When did Finland join the EU ?<pad>SCONJ AUX PROPN VERB DET PROPN PUNCT<pad>advmod aux nsubj ROOT det dobj punct<pad>2 2 2 1 3 2 2\n",
      "ref sparql: SELECT DISTINCT ?date WHERE { wd:Q211 <p:P463> ?membership . ?membership ps:P463 wd:Q458 . ?membership pq:P580 ?date . }\n",
      "pred sparql: SELECT DISTINCT ?date WHERE { wd:Q211 <p_P463> ?membership . ?membership <p_statement/P463> wd:Q458 . ?membership <p_qualifier/P580> ?date . } \n",
      "\n",
      "id: 168\n",
      "question: Which actors play in Big Bang Theory?<pad>Which actors play in Big Bang Theory ?<pad>DET NOUN VERB ADP PROPN PROPN PROPN PUNCT<pad>det nsubj ROOT prep compound compound pobj punct<pad>3 2 1 2 5 4 3 2\n",
      "ref sparql: SELECT ?o1 WHERE { wd:Q858840 wdt:P161 ?o1 . } \n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q5620660 ^<p_qualifier/P453>/<p_statement/P161> ?uri } \n",
      "\n",
      "id: 166\n",
      "question: Which computer scientist won an oscar?<pad>Which computer scientist won an oscar ?<pad>DET NOUN NOUN VERB DET NOUN PUNCT<pad>det compound nsubj ROOT det dobj punct<pad>3 3 2 1 3 2 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P1344 wd:Q127050 . ?scientist wdt:P279* wd:Q901 . ?uri wdt:P106 ?scientist . ?uri wdt:P166 wd:Q35637 . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P1344 wd:Q127050 . ?scientist wdt:P279* wd:Q901 . ?uri wdt:P106 ?scientist . ?uri wdt:P166 wd:Q35637 . } \n",
      "\n",
      "id: 160\n",
      "question: Who wrote Harry Potter?<pad>Who wrote Harry Potter ?<pad>PRON VERB PROPN PROPN PUNCT<pad>nsubj ROOT compound dobj punct<pad>2 1 3 2 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q11679 wdt:P50 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q2695156 wdt:P170 ?uri . } \n",
      "\n",
      "id: 157\n",
      "question: Give me English actors starring in Lovesick.<pad>Give me English actors starring in Lovesick .<pad>VERB PRON ADJ NOUN VERB ADP PROPN PUNCT<pad>ROOT dative amod dobj acl prep pobj punct<pad>1 2 3 2 3 4 5 2\n",
      "ref sparql: SELECT ?o1 WHERE { wd:Q858840 wdt:P161 ?o1 . } \n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q33999 ; rdfs_label ?label . FILTER(CONTAINS( ?label, \"Baldwin\")) } \n",
      "\n",
      "id: 150\n",
      "question: In which city was the president of Montenegro born?<pad>In which city was the president of Montenegro born ?<pad>ADP DET NOUN AUX DET NOUN ADP PROPN VERB PUNCT<pad>prep det nsubj ROOT det attr prep pobj advcl punct<pad>2 3 2 1 3 2 3 4 2 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q154946 wdt:P119 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q986 wdt:P35 ?uri } \n",
      "\n",
      "id: 149\n",
      "question: Which U.S. state has the highest population density?<pad>Which U.S. state has the highest population density ?<pad>DET PROPN NOUN VERB DET ADJ NOUN NOUN PUNCT<pad>det compound nsubj ROOT det amod compound dobj punct<pad>3 3 2 1 3 3 3 2 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q35657 ; wdt:P2046 ?area ; wdt:P1082 ?population . BIND((?population/?area) AS ?density) . } ORDER BY DESC(?density) LIMIT 1\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q35657 ; wdt:P2046 ?area ; wdt:P1082 ?population . BIND(( ?population/ ?area) AS ?density) . } ORDER BY DESC( ?density) LIMIT 1\n",
      "\n",
      "id: 25\n",
      "question: What is the longest river in China?<pad>What is the longest river in China ?<pad>PRON AUX DET ADJ NOUN ADP PROPN PUNCT<pad>attr ROOT det amod nsubj prep pobj punct<pad>2 1 3 3 2 3 4 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q4022 . ?uri p:P2043\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q4022 . ?uri p_P2043 ?stmnode . ?stmnode psv_P2043 ?valuenode . ?valuenode wikibase_quantityAmount ?length . ?valuenode wikibase_quantityUnit ?unit . ?valuenode wikibase_quantityLowerBound ?lowerbound . ?valuenode wikibase_quantityUpperBound ?upperbound .\n",
      "\n",
      "id: 143\n",
      "question: What is the area code of Berlin?<pad>What is the area code of Berlin ?<pad>PRON AUX DET NOUN NOUN ADP PROPN PUNCT<pad>attr ROOT det compound nsubj prep pobj punct<pad>2 1 3 3 2 3 4 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q1010 wdt:P1082 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q62408 wdt:P131 ?uri . } \n",
      "\n",
      "id: 140\n",
      "question: How many scientists graduated from an Ivy League university?<pad>How many scientists graduated from an Ivy League university ?<pad>SCONJ ADJ NOUN VERB ADP DET PROPN PROPN NOUN PUNCT<pad>advmod amod nsubj ROOT prep det compound compound pobj punct<pad>4 3 2 1 2 4 5 4 3 2\n",
      "ref sparql: SELECT DISTINCT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri wdt:P1344 wd:Q127050 . ?scientist wdt:P279* wd:Q901 . ?uri wdt:P106 ?scientist . ?uri wdt:P166 wd:Q35637 . }\n",
      "pred sparql: SELECT DISTINCT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri wdt:P106 wd:Q82955 ; wdt:P69 wd:Q49088 . } \n",
      "\n",
      "id: 139\n",
      "question: Which professional surfers were born in Australia?<pad>Which professional surfers were born in Australia ?<pad>DET ADJ NOUN AUX VERB ADP PROPN PUNCT<pad>det amod nsubjpass auxpass ROOT prep pobj punct<pad>3 3 2 2 1 2 3 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q10843402 ; wdt:P19 wd:Q649 . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q10800557 . { ?uri wdt:P19 wd:Q183 . } UNION { ?uri wdt:P19/wdt:P17 wd:Q183 . } } \n",
      "\n",
      "id: 137\n",
      "question: Give me all Dutch parties.<pad>Give me all Dutch parties .<pad>VERB PRON DET ADJ NOUN PUNCT<pad>ROOT dative det amod dobj punct<pad>1 2 3 3 2 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q7278 ; wdt:P17 wd:Q41 ; wdt:P1142 wd:Q3781399 . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q7278 ; wdt:P17 wd:Q41 ; wdt:P1142 wd:Q3781399 . } \n",
      "\n",
      "id: 136\n",
      "question: How many moons does Mars have?<pad>How many moons does Mars have ?<pad>SCONJ ADJ NOUN AUX PROPN VERB PUNCT<pad>advmod amod dobj aux nsubj ROOT punct<pad>4 3 2 2 2 1 2\n",
      "ref sparql: SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri wdt:P31 wd:Q61702557 . }\n",
      "pred sparql: SELECT ?mass WHERE { ?res wdt:P31 wd:Q61702557 . ?res wdt:P2067 ?mass . } ORDER BY ?mass LIMIT 1\n",
      "\n",
      "id: 134\n",
      "question: What is Batman's real name?<pad>What is Batman 's real name ?<pad>PRON AUX PROPN PART ADJ NOUN PUNCT<pad>attr ROOT poss case amod nsubj punct<pad>2 1 3 4 3 2 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q166262 wdt:P1477 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?name WHERE { wd:Q2695156 wdt:P170 ?name . } \n",
      "\n",
      "id: 132\n",
      "question: What is Elon Musk famous for?<pad>What is Elon Musk famous for ?<pad>PRON AUX PROPN PROPN ADJ ADP PUNCT<pad>attr ROOT compound nsubj amod prep punct<pad>2 1 3 2 3 4 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P488 wd:Q22686 ; wdt:P31/wdt:P279* wd:Q4830453 . MINUS { ?uri wdt:P576 ?closed } }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q5582 wdt:P737 ?uri . } \n",
      "\n",
      "id: 128\n",
      "question: Who is the author of WikiLeaks?<pad>Who is the author of WikiLeaks ?<pad>PRON AUX DET NOUN ADP PROPN PUNCT<pad>attr ROOT det nsubj prep pobj punct<pad>2 1 3 2 3 4 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q52 wdt:P112 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q52 wdt:P112 ?uri . } \n",
      "\n",
      "id: 124\n",
      "question: When was Carlo Giuliani shot?<pad>When was Carlo Giuliani shot ?<pad>SCONJ AUX PROPN PROPN VERB PUNCT<pad>advmod auxpass compound nsubj ROOT punct<pad>3 2 3 2 1 2\n",
      "ref sparql: SELECT DISTINCT ?date WHERE { wd:Q53713 <p:P570> ?date }\n",
      "pred sparql: SELECT DISTINCT ?date WHERE { wd:Q53713 <p_P570> ?date } \n",
      "\n",
      "id: 122\n",
      "question: Who was the wife of President Lincoln?<pad>Who was the wife of President Lincoln ?<pad>PRON AUX DET NOUN ADP PROPN PROPN PUNCT<pad>attr ROOT det nsubj prep compound pobj punct<pad>2 1 3 2 3 5 4 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q91 wdt:P26 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q91 wdt:P26 ?uri . } \n",
      "\n",
      "id: 111\n",
      "question: How many awards has Bertrand Russell?<pad>How many awards has Bertrand Russell ?<pad>SCONJ ADJ NOUN VERB PROPN PROPN PUNCT<pad>advmod amod nsubj ROOT compound dobj punct<pad>4 3 2 1 3 2 2\n",
      "ref sparql: SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE { wd:Q319308 wdt:P166 wd:Q34969 . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q319308 wdt:P166 ?uri . } \n",
      "\n",
      "id: 117\n",
      "question: Is Pamela Anderson a vegan?<pad>Is Pamela Anderson a vegan ?<pad>AUX PROPN PROPN DET NOUN PUNCT<pad>ROOT compound nsubj det appos punct<pad>1 3 2 4 3 2\n",
      "ref sparql: ASK WHERE { wd:Q134041 wdt:P106 wd:Q40050 . }\n",
      "pred sparql: ASK WHERE { wd:Q303 wdt:P40 ?uri } \n",
      "\n",
      "id: 59\n",
      "question: Which space probes were sent into orbit around the sun?<pad>Which space probes were sent into orbit around the sun ?<pad>DET NOUN NOUN AUX VERB ADP NOUN ADP DET NOUN PUNCT<pad>det compound nsubjpass auxpass ROOT prep pobj prep det pobj punct<pad>3 3 2 2 1 2 3 2 4 3 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P1427 wd:Q177477 }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P1427 wd:Q177477 } \n",
      "\n",
      "id: 113\n",
      "question: Which German cities have more than 250000 inhabitants?<pad>Which German cities have more than 250000 inhabitants ?<pad>PRON ADJ NOUN VERB ADJ ADP NUM NOUN PUNCT<pad>dobj amod nsubj ROOT amod quantmod nummod dobj punct<pad>2 3 2 1 4 4 3 2 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q515 ; wdt:P131+ wd:Q515 . } GROUP BY ?uri HAVING(COUNT(DISTINCT ?uri) as ?cnt) { ?uri wdt:P31 wd:Q515 . } UNION { ?uri w\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q515 . ?uri wdt:P131+ wd:Q1408 . ?uri wdt:P1082 ?population . FILTER( ?population > 100000) } \n",
      "\n",
      "id: 104\n",
      "question: Who is the daughter of Robert Kennedy married to?<pad>Who is the daughter of Robert Kennedy married to ?<pad>PRON AUX DET NOUN ADP PROPN PROPN VERB ADP PUNCT<pad>attr ROOT det nsubj prep compound pobj advcl prep punct<pad>2 1 3 2 3 5 4 2 3 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q9696 wdt:P26 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q9696 p_P26 ?wife . ?wife rdfs_label ?name . FILTER regex( ?name, \"Michelle\") } \n",
      "\n",
      "id: 10\n",
      "question: How many students does the Free University of Amsterdam have?<pad>How many students does the Free University of Amsterdam have ?<pad>SCONJ ADJ NOUN AUX DET PROPN PROPN ADP PROPN VERB PUNCT<pad>advmod amod nsubj aux det compound nsubj prep pobj ROOT punct<pad>5 4 3 2 3 3 2 3 4 1 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q2685 wdt:P69 ?uri . ?uri wdt:P31/wdt:P279* wd:Q3918 . }\n",
      "pred sparql: SELECT DISTINCT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri wdt:P106 wd:Q82955 ; wdt:P69 wd:Q49088 . } \n",
      "\n",
      "id: 178\n",
      "question: How many James Bond movies do exist?<pad>How many James Bond movies do exist ?<pad>SCONJ ADJ PROPN PROPN NOUN AUX VERB PUNCT<pad>advmod amod compound compound nsubj aux ROOT punct<pad>4 3 4 3 2 2 1 2\n",
      "ref sparql: SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri wdt:P31 wd:Q11424 ; wdt:P2130 ?uri . }\n",
      "pred sparql: SELECT (COUNT(DISTINCT ?uri) as ?count) WHERE { ?uri wdt:P57 wd:Q315484 . } \n",
      "\n",
      "id: 129\n",
      "question: Who does the voice of Bart Simpson?<pad>Who does the voice of Bart Simpson ?<pad>PRON VERB DET NOUN ADP PROPN PROPN PUNCT<pad>nsubj ROOT det dobj prep compound pobj punct<pad>2 1 3 2 3 5 4 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q51803 wdt:P175 ?uri }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q154216 wdt:P1303 ?uri . } \n",
      "\n",
      "id: 183\n",
      "question: Who was Tom Hanks married to?<pad>Who was Tom Hanks married to ?<pad>PRON AUX PROPN PROPN VERB ADP PUNCT<pad>attr ROOT compound nsubj acomp prep punct<pad>2 1 3 2 2 3 2\n",
      "ref sparql: SELECT DISTINCT ?o1 WHERE { wd:Q37079 wdt:P26 ?o1 . }\n",
      "pred sparql: SELECT DISTINCT ?o1 WHERE { wd:Q37079 wdt:P26 ?o1 . } \n",
      "\n",
      "id: 181\n",
      "question: Through which countries does the Yenisei river flow?<pad>Through which countries does the Yenisei river flow ?<pad>ADP DET NOUN VERB DET PROPN NOUN NOUN PUNCT<pad>prep det nsubj ROOT det compound compound dobj punct<pad>2 3 2 1 3 3 3 2 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q6386177 wdt:P17 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q5451 wdt:P17 ?uri . } \n",
      "\n",
      "id: 7\n",
      "question: Give me all cars that are produced in Germany.<pad>Give me all cars that are produced in Germany .<pad>VERB PRON DET NOUN PRON AUX VERB ADP PROPN PUNCT<pad>ROOT dative det dobj nsubjpass auxpass relcl prep pobj punct<pad>1 2 3 2 4 4 3 4 5 2\n",
      "ref sparql: SELECT ?res WHERE { ?res wdt:P176 wd:Q152815 . ?res wdt:P279*/wdt:P31 wd:Q15142889 . } \n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q4830453 . ?uri wdt:P31 ?type ; wdt:P495 wd:Q35 . } \n",
      "\n",
      "id: 135\n",
      "question: When did Michael Jackson die?<pad>When did Michael Jackson die ?<pad>SCONJ AUX PROPN PROPN VERB PUNCT<pad>advmod aux compound nsubj ROOT punct<pad>2 2 3 2 1 2\n",
      "ref sparql: SELECT DISTINCT ?date WHERE { wd:Q53713 <p:P570> ?date }\n",
      "pred sparql: SELECT DISTINCT ?val WHERE { wd:Q11806 wdt:P569 ?val . } \n",
      "\n",
      "id: 50\n",
      "question: What is the highest volcano in Africa?<pad>What is the highest volcano in Africa ?<pad>PRON AUX DET ADJ NOUN ADP PROPN PUNCT<pad>attr ROOT det amod nsubj prep pobj punct<pad>2 1 3 3 2 3 4 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q8502 ; wdt:P17 wd:Q38 ; wdt:P2044 ?elevation . } ORDER BY DESC(?elevation) LIMIT 1\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q8502 . ?uri wdt:P30 wd:Q3960 . ?uri wdt:P2044 ?height . } ORDER BY DESC( ?height) LIMIT 1\n",
      "\n",
      "id: 39\n",
      "question: Which poet wrote the most books?<pad>Which poet wrote the most books ?<pad>DET NOUN VERB DET ADJ NOUN PUNCT<pad>det nsubj ROOT det amod dobj punct<pad>3 2 1 3 3 2 2\n",
      "ref sparql: SELECT DISTINCT ?s1 WHERE { ?s1 wdt:P106 wd:Q49757 . ?s2 wdt:P50 ?s1 . ?s2 wdt:P31 wd:Q571 . } GROUP BY ?s1 ORDER BY\n",
      "pred sparql: SELECT DISTINCT ?s1 WHERE { ?s1 wdt:P106 wd:Q49757 . ?s2 wdt:P50 ?s1 . ?s2 wdt:P31 wd:Q571 . } GROUP BY ?s1 ORDER BY DESC(COUNT( ?s2)) OFFSET 0 LIMIT 1\n",
      "\n",
      "id: 71\n",
      "question: Give me all spacecrafts that flew to Mars.<pad>Give me all spacecrafts that flew to Mars .<pad>VERB PRON DET NOUN PRON VERB ADP PROPN PUNCT<pad>ROOT dative det dobj nsubj relcl prep pobj punct<pad>1 2 3 2 4 3 4 5 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P1427 wd:Q177477 }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P1427 wd:Q177477 } \n",
      "\n",
      "id: 213\n",
      "question: Show me all Czech movies.<pad>Show me all Czech movies .<pad>VERB PRON DET PROPN NOUN PUNCT<pad>ROOT dative det amod dobj punct<pad>1 2 3 3 2 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q11424 . ?uri wdt:P31 ?type ; wdt:P495 wd:Q35 . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q11424 . ?uri wdt:P31 ?type ; wdt:P495 wd:Q35 . } \n",
      "\n",
      "id: 209\n",
      "question: Give me all taikonauts.<pad>Give me all taikonauts .<pad>VERB PRON DET NOUN PUNCT<pad>ROOT dative det dobj punct<pad>1 2 3 2 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q11631 . { ?uri wdt:P27 wd:Q15180 } UNION { ?uri wdt:P27 wd:Q159 } }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q11631 . { ?uri wdt:P27 wd:Q15180 } UNION { ?uri wdt:P27 wd:Q159 } } \n",
      "\n",
      "id: 105\n",
      "question: Which countries have more than ten volcanoes?<pad>Which countries have more than ten volcanoes ?<pad>DET NOUN VERB ADJ ADP NUM NOUN PUNCT<pad>det nsubj ROOT amod quantmod nummod dobj punct<pad>3 2 1 4 4 3 2 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q6256 . ?uri wdt:P131+ wd:Q1408 . ?uri wdt:P1082 ?lake . ?uri <p:\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q4022 . ?uri p_P2043 ?stmnode . ?stmnode psv_P2043 ?valuenode . ?valuenode wikibase_quantityAmount ?length . ?valuenode wikibase_quantityUnit ?unit . ?valuenode wikibase_quantityLowerBound ?lowerbound . ?valuenode wikibase_quantityUpperBound ?upperbound .\n",
      "\n",
      "id: 52\n",
      "question: Give me all movies with Tom Cruise.<pad>Give me all movies with Tom Cruise .<pad>VERB PRON DET NOUN ADP PROPN PROPN PUNCT<pad>ROOT dative det dobj prep compound pobj punct<pad>1 2 3 2 3 5 4 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P161 wd:Q37079. }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P161 wd:Q37079 . } \n",
      "\n",
      "id: 102\n",
      "question: When did Dracula's creator die?<pad>When did Dracula 's creator die ?<pad>SCONJ AUX PROPN PART NOUN VERB PUNCT<pad>advmod aux poss case nsubj ROOT punct<pad>2 2 3 4 2 1 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q2695156 wdt:P570 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q5930 wdt:P170 ?uri } \n",
      "\n",
      "id: 21\n",
      "question: Who created English Wikipedia?<pad>Who created English Wikipedia ?<pad>PRON VERB PROPN PROPN PUNCT<pad>nsubj ROOT compound dobj punct<pad>2 1 3 2 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q52 wdt:P112 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q52 wdt:P112 ?uri . } \n",
      "\n",
      "id: 34\n",
      "question: Give me all female German chancellors.<pad>Give me all female German chancellors .<pad>VERB PRON DET ADJ ADJ NOUN PUNCT<pad>ROOT dative det amod amod dobj punct<pad>1 2 3 3 3 2 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q116 ; wdt:P26 ?spouse . ?spouse wdt:P27 wd:Q183 . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q116 ; wdt:P26 ?spouse . ?spouse wdt:P27 wd:Q183 . } \n",
      "\n",
      "id: 145\n",
      "question: Who owns Aldi?<pad>Who owns Aldi ?<pad>PRON VERB PROPN PUNCT<pad>nsubj ROOT dobj punct<pad>2 1 2 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q243278 wdt:P127 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q5930 wdt:P170 ?uri } \n",
      "\n",
      "id: 198\n",
      "question: Who was influenced by Socrates?<pad>Who was influenced by Socrates ?<pad>PRON AUX VERB ADP PROPN PUNCT<pad>nsubjpass auxpass ROOT agent pobj punct<pad>2 2 1 2 3 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q868 wdt:P737 wd:Q913 . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q596 wdt:P61 ?uri . } \n",
      "\n",
      "id: 162\n",
      "question: How deep is Lake Chiemsee?<pad>How deep is Lake Chiemsee ?<pad>SCONJ ADJ AUX PROPN PROPN PUNCT<pad>advmod acomp ROOT compound nsubj punct<pad>3 2 1 3 2 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q5513 wdt:P2046 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?num WHERE { wd:Q1207989 wdt:P2048 ?num . } \n",
      "\n",
      "id: 212\n",
      "question: Which companies work in the aerospace industry as well as in medicine?<pad>Which companies work in the aerospace industry as well as in medicine ?<pad>DET NOUN VERB ADP DET NOUN NOUN ADV ADV ADP ADP NOUN PUNCT<pad>det nsubj ROOT prep det compound pobj advmod advmod cc prep pobj punct<pad>3 2 1 2 4 4 3 4 4 3 2 3 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q212282 . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?hovercraft wdt:P31/wdt:P279* wd:Q185757 ; wdt:P176 ?uri . } \n",
      "\n",
      "id: 96\n",
      "question: Which professional surfers were born on the Philippines?<pad>Which professional surfers were born on the Philippines ?<pad>DET ADJ NOUN AUX VERB ADP DET PROPN PUNCT<pad>det amod nsubjpass auxpass ROOT prep det pobj punct<pad>3 3 2 2 1 2 4 3 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q10843402 ; wdt:P19 wd:Q649 . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q937857 ; wdt:P19 ?birthPlace . ?birthPlace wdt:P17 wd:Q233 . } \n",
      "\n",
      "id: 40\n",
      "question: Who were the parents of Queen Victoria?<pad>Who were the parents of Queen Victoria ?<pad>PRON AUX DET NOUN ADP PROPN PROPN PUNCT<pad>attr ROOT det nsubj prep compound pobj punct<pad>2 1 3 2 3 5 4 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q152316 wdt:P22 ?father ; wdt:P25 ?mother . wd:Q36812 wdt:P22 ?father ; wdt:P25 ?mother . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q154946 wdt:P119 ?uri . } \n",
      "\n",
      "id: 79\n",
      "question: Are there any castles in the United States?<pad>Are there any castles in the United States ?<pad>AUX PRON DET NOUN ADP DET PROPN PROPN PUNCT<pad>ROOT expl det attr prep det compound pobj punct<pad>1 2 3 2 3 5 5 4 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q1207989 ; wdt:P17 wd:Q30 . }\n",
      "pred sparql: ASK WHERE { ?uri wdt:P31 wd:Q33506 . ?uri wdt:P276 wd:Q84 . } \n",
      "\n",
      "id: 141\n",
      "question: Which languages are spoken in Estonia?<pad>Which languages are spoken in Estonia ?<pad>DET NOUN AUX VERB ADP PROPN PUNCT<pad>det nsubjpass auxpass ROOT prep pobj punct<pad>3 2 2 1 2 3 2\n",
      "ref sparql: SELECT * WHERE { wd:Q191 wdt:P2936 ?lang . }\n",
      "pred sparql: SELECT * WHERE { wd:Q191 wdt:P2936 ?lang . } \n",
      "\n",
      "id: 80\n",
      "question: Give me a list of all critically endangered birds.<pad>Give me a list of all critically endangered birds .<pad>VERB PRON DET NOUN ADP DET ADV VERB NOUN PUNCT<pad>ROOT dative det dobj prep det advmod amod pobj punct<pad>1 2 3 2 3 5 6 5 4 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q7378 ; wdt:P17 wd:Q408 ; wdt:P1082 ?population . } ORDER BY DESC(?population) LIMIT 1\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P279* wd:Q38280 FILTER( ?uri != wd:Q38280) } \n",
      "\n",
      "id: 159\n",
      "question: Which countries are connected by the Rhine?<pad>Which countries are connected by the Rhine ?<pad>DET NOUN AUX VERB ADP DET PROPN PUNCT<pad>det nsubjpass auxpass ROOT agent det pobj punct<pad>3 2 2 1 2 4 3 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q3392 wdt:P885/wdt:P17 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q5451 wdt:P17 ?uri . } \n",
      "\n",
      "id: 107\n",
      "question: Who was the father of Queen Elizabeth II?<pad>Who was the father of Queen Elizabeth II ?<pad>PRON AUX DET NOUN ADP PROPN PROPN PROPN PUNCT<pad>attr ROOT det nsubj prep compound compound pobj punct<pad>2 1 3 2 3 5 5 4 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q152316 wdt:P22 ?father ; wdt:P25 ?mother . ?mother wdt:P22 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q989 <p_P39> ?position . ?position <p_statement/P39> wd:Q19546 . ?position <p_qualifier/P1366> ?uri } \n",
      "\n",
      "id: 163\n",
      "question: Give me all chemical elements.<pad>Give me all chemical elements .<pad>VERB PRON DET ADJ NOUN PUNCT<pad>ROOT dative det amod dobj punct<pad>1 2 3 3 2 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q635637 ; wdt:P17 wd:Q35637 . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P279 wd:Q373822 . } \n",
      "\n",
      "id: 211\n",
      "question: Give me all American presidents of the last 20 years.<pad>Give me all American presidents of the last 20 years .<pad>VERB PRON DET ADJ NOUN ADP DET ADJ NUM NOUN PUNCT<pad>ROOT dative det amod dobj prep det amod nummod pobj punct<pad>1 2 3 3 2 3 5 5 5 4 2\n",
      "ref sparql: SELECT ?uri WHERE { ?uri wdt:P39 wd:Q473984 . ?uri p:P39 ?statement . ?statement pq:P580 ?startDate ; ps:P582 ?date . FILTER(?date >= \n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P39 wd:Q9259 ; wdt:P575 ?date . BIND(xsd_integer(YEAR( ?date)) as ?year) . BIND(xsd_integer(YEAR(NOW())) as ?currentYear) . FILTER( ?year < ?currentYear && ?year < ( ?currentYear - 2)) . } \n",
      "\n",
      "id: 51\n",
      "question: When is the movie Worst Case Scenario going to be in cinemas in the Netherlands?<pad>When is the movie Worst Case Scenario going to be in cinemas in the Netherlands ?<pad>SCONJ AUX DET NOUN PROPN PROPN PROPN VERB PART AUX ADP NOUN ADP DET PROPN PUNCT<pad>advmod ROOT det nsubj compound compound nsubj relcl aux xcomp prep pobj prep det pobj punct<pad>2 1 3 2 6 5 4 3 5 4 5 6 5 7 6 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q11424 ; wdt:P495 wd:Q35 . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q2608065 wdt:P582 ?uri . } \n",
      "\n",
      "id: 144\n",
      "question: Whom did Lance Bass marry?<pad>Whom did Lance Bass marry ?<pad>PRON AUX PROPN PROPN VERB PUNCT<pad>nsubj aux compound nsubj ROOT punct<pad>3 2 3 2 1 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q37079 wdt:P26 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q43247 wdt:P40 ?child . ?child wdt:P26 ?uri . } \n",
      "\n",
      "id: 131\n",
      "question: What languages are spoken in Pakistan?<pad>What languages are spoken in Pakistan ?<pad>DET NOUN AUX VERB ADP PROPN PUNCT<pad>det nsubjpass auxpass ROOT prep pobj punct<pad>3 2 2 1 2 3 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q874 wdt:P2936 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q928 wdt:P37 ?uri . } \n",
      "\n",
      "id: 120\n",
      "question: Who is the daughter of Bill Clinton married to?<pad>Who is the daughter of Bill Clinton married to ?<pad>PRON AUX DET NOUN ADP PROPN PROPN VERB ADP PUNCT<pad>attr ROOT det nsubj prep compound pobj advcl prep punct<pad>2 1 3 2 3 5 4 2 3 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q9696 wdt:P40 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q43247 wdt:P40 ?child . ?child wdt:P26 ?uri . } \n",
      "\n",
      "id: 164\n",
      "question: Who was on the Apollo 11 mission?<pad>Who was on the Apollo 11 mission ?<pad>PRON AUX ADP DET PROPN NUM NOUN PUNCT<pad>nsubj ROOT prep det nmod nummod pobj punct<pad>2 1 2 4 4 5 3 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q178871 wdt:P1029 ?uri }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q178871 wdt:P1029 ?uri } \n",
      "\n",
      "id: 151\n",
      "question: Give me all B-sides of the Ramones.<pad>Give me all B - sides of the Ramones .<pad>VERB PRON DET NOUN PUNCT NOUN ADP DET PROPN PUNCT<pad>ROOT dative det compound punct dobj prep det pobj punct<pad>1 2 3 3 3 2 3 5 4 2\n",
      "ref sparql: SELECT ?res WHERE { ?res wdt:P175 wd:Q483407 . ?res p:P1433 _:\n",
      "pred sparql: SELECT ?res WHERE { ?res wdt:P175 wd:Q483407 . ?res p_P1433 __a . __a pq_P2868 wd:Q13432985 . } \n",
      "\n",
      "id: 63\n",
      "question: Who was called Scarface?<pad>Who was called Scarface ?<pad>PRON AUX VERB PROPN PUNCT<pad>nsubjpass auxpass ROOT oprd punct<pad>2 2 1 2 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q51803 wdt:P175 ?uri }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q5930 wdt:P170 ?uri } \n",
      "\n",
      "id: 27\n",
      "question: Which rivers flow into the North Sea?<pad>Which rivers flow into the North Sea ?<pad>DET NOUN VERB ADP DET PROPN PROPN PUNCT<pad>det nsubj ROOT prep det compound pobj punct<pad>3 2 1 2 4 4 3 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q4022 . ?lake wdt:P31 wd:Q23397 ; wdt:P17 wd:183 . ?uri wdt:P200 ?lake . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q4022 . ?lake wdt:P31 wd:Q23397 ; wdt:P17 wd:183 . ?uri wdt:P200 ?lake . } \n",
      "\n",
      "id: 156\n",
      "question: Where is Fort Knox located?<pad>Where is Fort Knox located ?<pad>SCONJ AUX PROPN PROPN VERB PUNCT<pad>advmod auxpass compound nsubjpass ROOT punct<pad>3 2 3 2 1 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q983650 wdt:P131+ ?uri . }\n",
      "pred sparql: SELECT ?res WHERE { wd:Q983650 wdt:P131+ ?res . ?res wdt:P31 wd:Q35657 . } \n",
      "\n",
      "id: 207\n",
      "question: Which daughters of British earls died at the same place they were born at?<pad>Which daughters of British earls died at the same place they were born at ?<pad>DET NOUN ADP ADJ NOUN VERB ADP DET ADJ NOUN PRON AUX VERB ADP PUNCT<pad>det nsubj prep amod pobj ROOT prep det amod pobj nsubjpass auxpass relcl prep punct<pad>3 2 3 5 4 1 2 4 4 3 5 5 4 5 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P19 _:a . ?uri wdt:P20 _:a . ?uri wdt:P106/wdt:P279* wd:Q10873124 . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P19 __a . ?uri wdt:P20 __a . ?uri wdt:P106/wdt:P279* wd:Q10873124 . } \n",
      "\n",
      "id: 24\n",
      "question: How many emperors did China have?<pad>How many emperors did China have ?<pad>SCONJ ADJ NOUN AUX PROPN VERB PUNCT<pad>advmod amod dobj aux nsubj ROOT punct<pad>4 3 2 2 2 1 2\n",
      "ref sparql: SELECT (COUNT(DISTINCT ?uri) as ?count) WHERE { ?uri wdt:P39 wd:Q55375123 . }\n",
      "pred sparql: SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri wdt:P39 wd:Q207329 } \n",
      "\n",
      "id: 133\n",
      "question: What are the names of the Teenage Mutant Ninja Turtles?<pad>What are the names of the Teenage Mutant Ninja Turtles ?<pad>PRON AUX DET NOUN ADP DET PROPN PROPN PROPN PROPN PUNCT<pad>attr ROOT det nsubj prep det compound compound compound pobj punct<pad>2 1 3 2 3 5 5 5 5 4 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q152316 wdt:P22 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q2695156 wdt:P170 ?uri . } \n",
      "\n",
      "id: 103\n",
      "question: Where does Piccadilly start?<pad>Where does Piccadilly start ?<pad>SCONJ AUX PROPN VERB PUNCT<pad>advmod aux nsubj ROOT punct<pad>2 2 2 1 2\n",
      "ref sparql: SELECT DISTINCT ?res WHERE { wd:Q1339 wdt:P19 ?res . } \n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q5930 wdt:P170 ?uri } \n",
      "\n",
      "id: 165\n",
      "question: What is the name of the university where Obama's wife studied?<pad>What is the name of the university where Obama 's wife studied ?<pad>PRON AUX DET NOUN ADP DET NOUN SCONJ PROPN PART NOUN VERB PUNCT<pad>attr ROOT det nsubj prep det pobj advmod poss case nsubj relcl punct<pad>2 1 3 2 3 5 4 4 5 6 4 3 2\n",
      "ref sparql: SELECT ?res WHERE { wd:Q2685 wdt:P69 ?res . ?res wdt:P31/wdt:P279* wd:Q3918 . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { VALUES ?types { wd:Q3918 wd:Q875538 } wd:Q567 wdt:P69 ?uri . ?uri wdt:P31 ?types . } \n",
      "\n",
      "id: 108\n",
      "question: When did Paraguay proclaim its independence?<pad>When did Paraguay proclaim its independence ?<pad>SCONJ AUX PROPN VERB PRON NOUN PUNCT<pad>advmod aux nsubj ROOT poss dobj punct<pad>2 2 2 1 3 2 2\n",
      "ref sparql: SELECT DISTINCT ?date WHERE { wd:Q928 <p:P39> ?date . }\n",
      "pred sparql: SELECT DISTINCT ?date WHERE { wd:Q9903 wdt:P576 ?date . } \n",
      "\n",
      "id: 15\n",
      "question: How short is the shortest active NBA player?<pad>How short is the shortest active NBA player ?<pad>SCONJ ADJ AUX DET ADV ADJ PROPN NOUN PUNCT<pad>advmod acomp ROOT det advmod amod compound nsubj punct<pad>3 2 1 3 4 3 3 2 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri w\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q3665646 ; wdt:P2048 ?height . } ORDER BY DESC( ?height) LIMIT 1\n",
      "\n",
      "id: 82\n",
      "question: When was Jack Wolfskin founded?<pad>When was Jack Wolfskin founded ?<pad>SCONJ AUX PROPN PROPN VERB PUNCT<pad>advmod auxpass compound nsubj ROOT punct<pad>2 2 3 2 1 2\n",
      "ref sparql: SELECT DISTINCT ?date WHERE { wd:Q622188 wdt:P62 ?date . }\n",
      "pred sparql: SELECT ?date WHERE { wd:Q622188 wdt:P571 ?date . } \n",
      "\n",
      "id: 9\n",
      "question: In which city is the headquarter of Air China?<pad>In which city is the headquarter of Air China ?<pad>ADP DET NOUN AUX DET NOUN ADP PROPN PROPN PUNCT<pad>prep det nsubj ROOT det attr prep compound pobj punct<pad>2 3 2 1 3 2 3 5 4 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q51747 wdt:P131 ?uri . { ?uri wdt:P31 wd:Q515 . } UNION {?uri wdt:P31/<p:direct/P279\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q51747 wdt:P113 ?uri . } \n",
      "\n",
      "id: 201\n",
      "question: What is the founding year of the brewery that produces Pilsner Urquell?<pad>What is the founding year of the brewery that produces Pilsner Urquell ?<pad>PRON AUX DET VERB NOUN ADP DET NOUN PRON VERB PROPN PROPN PUNCT<pad>attr ROOT det amod nsubj prep det pobj nsubj relcl compound dobj punct<pad>2 1 3 3 2 3 5 4 6 5 7 6 2\n",
      "ref sparql: SELECT ?year WHERE { wd:Q622188 wdt:P571 ?year . ?year wdt:P31/wdt:P279* wd:Q43229 . FILTER(year(?year) = 1930) . }\n",
      "pred sparql: SELECT DISTINCT ?date WHERE { wd:Q241665 wdt:P571 ?date . } \n",
      "\n",
      "id: 171\n",
      "question: When did the Boston Tea Party take place?<pad>When did the Boston Tea Party take place ?<pad>SCONJ AUX DET PROPN PROPN PROPN VERB NOUN PUNCT<pad>advmod aux det compound compound nsubj ROOT dobj punct<pad>2 2 3 3 3 2 1 2 2\n",
      "ref sparql: SELECT DISTINCT ?date WHERE { wd:Q622188 wdt:P571 ?date . }\n",
      "pred sparql: SELECT DISTINCT ?date WHERE { wd:Q8641370 wdt:P580 ?date . } \n",
      "\n",
      "id: 182\n",
      "question: Which animals are critically endangered?<pad>Which animals are critically endangered ?<pad>DET NOUN AUX ADV VERB PUNCT<pad>det nsubjpass auxpass advmod ROOT punct<pad>3 2 2 2 1 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q7378 ; wdt:P17 wd:Q408 ; wdt:P1082 ?population . } ORDER BY DESC(?population) LIMIT 1\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P279* wd:Q38280 FILTER( ?uri != wd:Q38280) } \n",
      "\n",
      "id: 13\n",
      "question: Which politicians were married to a German?<pad>Which politicians were married to a German ?<pad>DET NOUN AUX ADJ ADP DET PROPN PUNCT<pad>det nsubj ROOT acomp prep det pobj punct<pad>3 2 1 2 3 5 4 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q82955 ; wdt:P26 ?spouse . ?spouse wdt:P27 wd:Q183 . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q116 ; wdt:P26 ?spouse . ?spouse wdt:P27 wd:Q183 . } \n",
      "\n",
      "id: 114\n",
      "question: How big is the earth's diameter?<pad>How big is the earth 's diameter ?<pad>SCONJ ADJ AUX DET NOUN PART NOUN PUNCT<pad>advmod acomp ROOT det poss case nsubj punct<pad>3 2 1 4 3 4 2 2\n",
      "ref sparql: SELECT ?area WHERE { wd:Q145 wdt:P2046 ?area . }\n",
      "pred sparql: SELECT ?area WHERE { wd:Q145 wdt:P2046 ?area . } \n",
      "\n",
      "id: 92\n",
      "question: Is the wife of President Obama called Michelle?<pad>Is the wife of President Obama called Michelle ?<pad>AUX DET NOUN ADP PROPN PROPN VERB PROPN PUNCT<pad>ROOT det nsubj prep compound pobj advcl dobj punct<pad>1 3 2 3 5 4 2 3 2\n",
      "ref sparql: ASK WHERE { wd:Q76 wdt:P26 ?wife . ?wife rdfs:label ?name . FILTER regex(?name, \"Michelle\") }\n",
      "pred sparql: ASK WHERE { wd:Q76 wdt:P26 ?wife . ?wife rdfs_label ?name . FILTER regex( ?name, \"Michelle\") } \n",
      "\n",
      "id: 194\n",
      "question: Which U.S. state has the abbreviation MN?<pad>Which U.S. state has the abbreviation MN ?<pad>DET PROPN NOUN VERB DET NOUN PROPN PUNCT<pad>det compound nsubj ROOT det dobj appos punct<pad>3 3 2 1 3 2 3 2\n",
      "ref sparql: SELECT ?res WHERE { wd:Q983650 wdt:P131+ ?res . ?res wdt:P31 wd:Q35657 . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q177397 wdt:P131 ?obj . ?obj wdt:P131 ?uri . } \n",
      "\n",
      "id: 175\n",
      "question: When did Muhammad die?<pad>When did Muhammad die ?<pad>SCONJ AUX PROPN VERB PUNCT<pad>advmod aux nsubj ROOT punct<pad>2 2 2 1 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q186924 wdt:P20 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q1339 wdt:P19 ?uri . } \n",
      "\n",
      "id: 60\n",
      "question: Who is the governor of Texas?<pad>Who is the governor of Texas ?<pad>PRON AUX DET NOUN ADP PROPN PUNCT<pad>attr ROOT det nsubj prep pobj punct<pad>2 1 3 2 3 4 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q1214 wdt:P6 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q30 p_P6 ?statement . ?statement pq_P580 ?startTime ; ps_P6 ?uri . } ORDER BY ?startTime OFFSET 7 LIMIT 1\n",
      "\n",
      "id: 110\n",
      "question: Which movies did Kurosawa direct?<pad>Which movies did Kurosawa direct ?<pad>DET NOUN VERB PROPN ADJ PUNCT<pad>det nsubj ROOT nsubj ccomp punct<pad>3 2 1 3 2 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P57 wd:Q2001}\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P57 wd:Q2001 } \n",
      "\n",
      "id: 206\n",
      "question: What was the name of the famous battle in 1836 in San Antonio?<pad>What was the name of the famous battle in 1836 in San Antonio ?<pad>PRON AUX DET NOUN ADP DET ADJ NOUN ADP NUM ADP PROPN PROPN PUNCT<pad>attr ROOT det nsubj prep det amod pobj prep pobj prep compound pobj punct<pad>2 1 3 2 3 5 5 4 5 6 5 7 6 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q937857 ; wdt:P19 ?city . ?city wdt:P159 wd:Q1471 . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q5503 ; wdt:P571 ?date . FILTER(!BOUND( ?date)) } \n",
      "\n",
      "id: 97\n",
      "question: Give me the official websites of actors of the television show Charmed.<pad>Give me the official websites of actors of the television show Charmed .<pad>VERB PRON DET ADJ NOUN ADP NOUN ADP DET NOUN NOUN PROPN PUNCT<pad>ROOT dative det amod dobj prep pobj prep det compound pobj npadvmod punct<pad>1 2 3 3 2 3 4 5 7 7 6 2 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q162371 wdt:P161 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q162371 wdt:P161/wdt:P569 ?date . } \n",
      "\n",
      "id: 169\n",
      "question: Give me all libraries established before 1400.<pad>Give me all libraries established before 1400 .<pad>VERB PRON DET NOUN VERB ADP NUM PUNCT<pad>ROOT dative det dobj acl prep pobj punct<pad>1 2 3 2 3 4 5 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q7075 ; wdt:P571 ?date . FILTER (YEAR(?date) < 1400 ) }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q7075 ; wdt:P571 ?date . FILTER (YEAR( ?date) < 1400 ) } \n",
      "\n",
      "id: 38\n",
      "question: Give me all Frisian islands that belong to the Netherlands.<pad>Give me all Frisian islands that belong to the Netherlands .<pad>VERB PRON DET ADJ NOUN PRON VERB ADP DET PROPN PUNCT<pad>ROOT dative det amod dobj nsubj relcl prep det pobj punct<pad>1 2 3 3 2 4 3 4 6 5 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q23442 ; wdt:P17 wd:Q17 . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q23442 ; wdt:P17 wd:Q17 . } \n",
      "\n",
      "id: 192\n",
      "question: Which museum exhibits The Scream by Munch?<pad>Which museum exhibits The Scream by Munch ?<pad>DET NOUN VERB DET PROPN ADP PROPN PUNCT<pad>det nsubj ROOT det dobj prep pobj punct<pad>3 2 1 3 2 2 3 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q33506 wdt:P131 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q33506 . ?uri wdt:P276 wd:Q84 . } \n",
      "\n",
      "id: 78\n",
      "question: When was the De Beers company founded?<pad>When was the De Beers company founded ?<pad>SCONJ AUX DET PROPN PROPN NOUN VERB PUNCT<pad>advmod aux det compound compound nsubj ROOT punct<pad>3 2 3 4 3 2 1 2\n",
      "ref sparql: SELECT ?date WHERE { wd:Q622188 wdt:P571 ?date . }\n",
      "pred sparql: SELECT ?date WHERE { wd:Q622188 wdt:P571 ?date . } \n",
      "\n",
      "id: 19\n",
      "question: Who became president after JFK died?<pad>Who became president after JFK died ?<pad>PRON VERB NOUN SCONJ PROPN VERB PUNCT<pad>nsubj ROOT attr mark nsubj advcl punct<pad>2 1 2 3 3 2 2\n",
      "ref sparql: PREFIX pq: pq: PREFIX ps: ps: PREFIX wdt: wdt: PREFIX wd: wd: PREFIX p: <p:> PREFIX pq: pq: PREFIX p: <http://www.wikidata.org/prop\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q9696 p_P39 ?presStatement . ?presStatement ps_P39 wd:Q11696 ; pq_P580 ?startPres ; pq_P582 ?endPres . ?uri p_P39 ?viceStatement . ?viceStatement ps_P39 wd:Q11699 ; pq_P580 ?startVice ; pq_P582 ?endV\n",
      "\n",
      "id: 190\n",
      "question: Who are the parents of the wife of Juan Carlos I?<pad>Who are the parents of the wife of Juan Carlos I ?<pad>PRON AUX DET NOUN ADP DET NOUN ADP PROPN PROPN PROPN PUNCT<pad>attr ROOT det nsubj prep det pobj prep compound compound pobj punct<pad>2 1 3 2 3 5 4 5 8 7 6 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q152316 wdt:P22 ?father ; wdt:P25 ?mother . wd:Q36812 wdt:P22 ?father ; wdt:P25 ?mother . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q43247 wdt:P40 ?child . ?child wdt:P26 ?uri . } \n",
      "\n",
      "id: 174\n",
      "question: Who is the novelist of the work a song of ice and fire?<pad>Who is the novelist of the work a song of ice and fire ?<pad>PRON AUX DET NOUN ADP DET NOUN DET NOUN ADP NOUN CCONJ NOUN PUNCT<pad>attr ROOT det nsubj prep det pobj det appos prep pobj cc conj punct<pad>2 1 3 2 3 5 4 4 3 4 5 6 6 2\n",
      "ref sparql: SELECT ?uri WHERE { wd:Q726382 wdt:P50 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q23572 wdt:P86 ?uri . } \n",
      "\n",
      "id: 152\n",
      "question: Which beer brewing companies are located in North-Rhine Westphalia?<pad>Which beer brewing companies are located in North - Rhine Westphalia ?<pad>DET NOUN NOUN NOUN AUX VERB ADP PROPN PUNCT PROPN PROPN PUNCT<pad>det compound compound nsubjpass auxpass ROOT prep compound punct compound pobj punct<pad>3 3 3 2 2 1 2 5 5 4 3 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q131734 . ?uri wdt:P17 wd:Q35 . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q131734 . ?uri wdt:P17 wd:Q408 . } \n",
      "\n",
      "id: 94\n",
      "question: When did princess Diana die?<pad>When did princess Diana die ?<pad>SCONJ AUX VERB PROPN VERB PUNCT<pad>advmod aux advcl dobj ROOT punct<pad>3 3 2 3 1 2\n",
      "ref sparql: SELECT DISTINCT ?date WHERE { wd:Q152316 wdt:P22 ?date . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q692 wdt:P570 ?uri . } \n",
      "\n",
      "id: 8\n",
      "question: Who founded Intel?<pad>Who founded Intel ?<pad>PRON VERB PROPN PUNCT<pad>nsubj ROOT dobj punct<pad>2 1 2 2\n",
      "ref sparql: SELECT ?uri WHERE { wd:Q49740 wdt:P178 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q49740 wdt:P178 ?uri . } \n",
      "\n",
      "id: 95\n",
      "question: Who is the youngest player in the Premier League?<pad>Who is the youngest player in the Premier League ?<pad>PRON AUX DET ADJ NOUN ADP DET PROPN PROPN PUNCT<pad>attr ROOT det amod nsubj prep det compound pobj punct<pad>2 1 3 3 2 3 5 5 4 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q18574233 ; wdt:P569 ?dateOfBirth . } ORDER BY DESC(?dateOfBirth) LIMIT 1\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q18574233 ; wdt:P569 ?dateOfBirth . } ORDER BY DESC( ?dateOfBirth) LIMIT 1\n",
      "\n",
      "id: 115\n",
      "question: How many rivers and lakes are in South Carolina?<pad>How many rivers and lakes are in South Carolina ?<pad>SCONJ ADJ NOUN CCONJ NOUN AUX ADP PROPN PROPN PUNCT<pad>advmod amod nsubj cc conj ROOT prep compound pobj punct<pad>4 3 2 3 3 1 2 4 3 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q4022 . ?lake wdt:P31 wd:Q23397 ; wdt:P17 wd:183 . ?uri wdt:P200 ?lake . }\n",
      "pred sparql: SELECT (COUNT( ?uri) AS ?count) WHERE { ?uri wdt:P31 wd:Q15149663 . } \n",
      "\n",
      "id: 116\n",
      "question: Who was called Rodzilla?<pad>Who was called Rodzilla ?<pad>PRON AUX VERB PROPN PUNCT<pad>nsubjpass auxpass ROOT oprd punct<pad>2 2 1 2 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q5930 wdt:P170 ?uri}\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q5930 wdt:P170 ?uri } \n",
      "\n",
      "id: 138\n",
      "question: Give me the capitals of all countries in Africa.<pad>Give me the capitals of all countries in Africa .<pad>VERB PRON DET NOUN ADP DET NOUN ADP PROPN PUNCT<pad>ROOT dative det dobj prep det pobj prep pobj punct<pad>1 2 3 2 3 5 4 5 6 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q258 wdt:P122 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { wd:Q1009 wdt:P36 ?uri } \n",
      "\n",
      "id: 177\n",
      "question: Which bridges are of the same type as the Manhattan Bridge?<pad>Which bridges are of the same type as the Manhattan Bridge ?<pad>DET NOUN AUX ADP DET ADJ NOUN ADP DET PROPN PROPN PUNCT<pad>det nsubj ROOT prep det amod pobj prep det compound pobj punct<pad>3 2 1 2 4 4 3 4 6 6 5 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { wd:Q125006 wdt:P287 ?uri . }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q12280 ; wdt:P177 wd:Q1471 . } \n",
      "\n",
      "id: 101\n",
      "question: How many companies were founded by the founder of Facebook?<pad>How many companies were founded by the founder of Facebook ?<pad>SCONJ ADJ NOUN AUX VERB ADP DET NOUN ADP PROPN PUNCT<pad>advmod amod nsubjpass auxpass ROOT agent det pobj prep pobj punct<pad>4 3 2 2 1 2 4 3 4 5 2\n",
      "ref sparql: SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE { ?uri wdt:P114 wd:Q380 ; wdt:P127 wd:Q82595 . }\n",
      "pred sparql: SELECT ?res WHERE { wd:Q380 wdt:P127 ?res . } \n",
      "\n",
      "id: 87\n",
      "question: Which book has the most pages?<pad>Which book has the most pages ?<pad>DET NOUN VERB DET ADJ NOUN PUNCT<pad>det nsubj ROOT det amod dobj punct<pad>3 2 1 3 3 2 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q571 ; wdt:P50 ?uri . } GROUP BY ?uri ORDER BY DESC(COUNT(?x)) LIMIT 1\n",
      "pred sparql: SELECT DISTINCT ?s1 WHERE { ?s1 wdt:P106 wd:Q49757 . ?s2 wdt:P50 ?s1 . ?s2 wdt:P31 wd:Q571 . } GROUP BY ?s1 ORDER BY DESC(COUNT( ?s2)) OFFSET 0 LIMIT 1\n",
      "\n",
      "id: 148\n",
      "question: What is the largest state in the United States?<pad>What is the largest state in the United States ?<pad>PRON AUX DET ADJ NOUN ADP DET PROPN PROPN PUNCT<pad>attr ROOT det amod nsubj prep det compound pobj punct<pad>2 1 3 3 2 3 5 5 4 2\n",
      "ref sparql: SELECT ?res WHERE { ?res wdt:P17 wd:Q30 . ?res wdt:P31/wdt:P279* wd:Q515 . ?res wdt:P1082 ?population . } ORDER BY DESC(?population) LIMIT 1\n",
      "pred sparql: SELECT ?res WHERE { ?res wdt:P17 wd:Q30 . ?res wdt:P31/wdt:P279* wd:Q515 . ?res wdt:P1082 ?population . } ORDER BY DESC( ?population) LIMIT 1\n",
      "\n",
      "id: 43\n",
      "question: Give me the websites of companies with more than 500000 employees.<pad>Give me the websites of companies with more than 500000 employees .<pad>VERB PRON DET NOUN ADP NOUN ADP ADJ ADP NUM NOUN PUNCT<pad>ROOT dative det dobj prep pobj prep amod quantmod nummod pobj punct<pad>1 2 3 2 3 4 2 5 5 4 3 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q4830453 . ?uri wdt:P31 ?type ; wdt:P1128 ?num . FILTER(?num > 1000000) }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q4830453 . ?uri wdt:P31 ?type ; wdt:P1128 ?num . FILTER( ?num > 1000000) } \n",
      "\n",
      "id: 179\n",
      "question: What were the names of the three ships by Columbus?<pad>What were the names of the three ships by Columbus ?<pad>PRON AUX DET NOUN ADP DET NUM NOUN ADP PROPN PUNCT<pad>attr ROOT det nsubj prep det nummod pobj prep pobj punct<pad>2 1 3 2 3 5 5 4 3 4 2\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q177477 }\n",
      "pred sparql: SELECT DISTINCT ?uri WHERE { ?uri wdt:P1427 wd:Q177477 } \n",
      "\n"
     ]
    }
   ],
   "source": [
    "for ref, pred in zip(ref_ques_list, pred_ques_list):\n",
    "    ques_pair = Ques_pair(ref, pred)\n",
    "    ref_sparql = re.sub(' +', ' ', ques_pair.ref_sparql)\n",
    "    pred_sparql = re.sub(' +', ' ', ques_pair.pred_sparql)\n",
    "    if ref_sparql != pred_sparql:\n",
    "        ques_pair.print()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.11"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
