{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "import sys\n",
    "sys.path.append('../../code/')\n",
    "from utils.data_io import read_json\n",
    "from Ques_pair import Ques_pair, Type"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "ref_file = read_json(\"../../datasets/qald9plus/qald_9_pp_test_wikidata_new.json\")\n",
    "pred_file = read_json(\"../../pred_files/mt5-xl-lcquad-ling-entity/en.json\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "ref_ques_list = [ref for ref in ref_file[\"questions\"]]\n",
    "pred_ques_list = [pred for pred in pred_file[\"questions\"]]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "id: 99\n",
      "question: What is the time zone of Salt Lake City?\n",
      "ref sparql: SELECT DISTINCT ?o1 WHERE { <http://www.wikidata.org/entity/Q23337>  <http://www.wikidata.org/prop/direct/P421>  ?o1 .  }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q23337 wdt:P421  ?answer  }  \n",
      "ref_answer:\n",
      " [{'o1': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q3134980'}}, {'o1': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q2212'}}]\n",
      "pred_answer:\n",
      " [{'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q3134980'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q2212'}}]\n",
      "\n",
      "\n",
      "id: 98\n",
      "question: Who killed Caesar?\n",
      "ref sparql: SELECT DISTINCT ?o1 WHERE { <http://www.wikidata.org/entity/Q1048>  <http://www.wikidata.org/prop/direct/P157>  ?o1 .  }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q1048 wdt:P157  ?answer  }  \n",
      "ref_answer:\n",
      " [{'o1': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q172248'}}, {'o1': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q207370'}}, {'o1': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q294846'}}, {'o1': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q1228715'}}, {'o1': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q1243545'}}]\n",
      "pred_answer:\n",
      " [{'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q172248'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q207370'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q294846'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q1228715'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q1243545'}}]\n",
      "\n",
      "\n",
      "id: 86\n",
      "question: What is the highest mountain in Germany?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P31 wd:Q8502 ; wdt:P2044 ?elevation ; wdt:P17 wd:Q183 . } ORDER BY DESC(?elevation) LIMIT 1\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q8502 wdt:P610  ?answer  }  \n",
      "ref_answer:\n",
      " [{'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q3375'}}]\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "\n",
      "id: 84\n",
      "question: Which American presidents were in office during the Vietnam War?\n",
      "ref sparql: SELECT DISTINCT ?o WHERE { <http://www.wikidata.org/entity/Q8740>  <http://www.wikidata.org/prop/direct/P580>  ?startWar . <http://www.wikidata.org/entity/Q8740>  <http://www.wikidata.org/prop/direct/P582>  ?endWar . <http://www.wikidata.org/entity/Q30>  <http://www.wikidata.org/prop/P6> ?blank . ?blank <http://www.wikidata.org/prop/statement/P6> ?o . ?blank <http://www.wikidata.org/prop/qualifier/P580> ?start . ?blank <http://www.wikidata.org/prop/qualifier/P582> ?end . FILTER (?startWar < ?start && ?endWar > ?end)} \n",
      "pred sparql: select distinct  ?answer where  {  wd:Q8740 wdt:P1308  ?answer  }  \n",
      "ref_answer:\n",
      " [{'o': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q9588'}}, {'o': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q9640'}}, {'o': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q9696'}}]\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "\n",
      "id: 81\n",
      "question: Butch Otter is the governor of which U.S. state?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT ?res WHERE { ?res wdt:P6 wd:Q39593 . }\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q39593 wdt:P35  ?X .  ?X wdt:P35  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "\n"
     ]
    }
   ],
   "source": [
    "n = 5\n",
    "for ref, pred in zip(ref_ques_list[:n], pred_ques_list[:n]):\n",
    "    ques_pair = Ques_pair(ref, pred)\n",
    "    ques_pair.print(print_answer=True)\n",
    "    print()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "entity_f1_sum = 0\n",
    "relation_f1_sum = 0\n",
    "num_of_ques = len(ref_ques_list)\n",
    "\n",
    "for ref, pred in zip(ref_ques_list, pred_ques_list):\n",
    "    ques_pair = Ques_pair(ref, pred)\n",
    "    entity_f1_sum += ques_pair.calculate_entity_f1()\n",
    "    relation_f1_sum += ques_pair.calculate_relation_f1()\n",
    "\n",
    "macro_entity_f1 = entity_f1_sum / num_of_ques\n",
    "macro_relation_f1 = relation_f1_sum / num_of_ques"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.007352941176470588"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "macro_entity_f1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.007312091503267974"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "macro_relation_f1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "id: 81\n",
      "question: Butch Otter is the governor of which U.S. state?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT ?res WHERE { ?res wdt:P6 wd:Q39593 . }\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q39593 wdt:P35  ?X .  ?X wdt:P35  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 4\n",
      "question: Which airports are located in California, USA?\n",
      "ref sparql: SELECT DISTINCT ?s1 WHERE { ?s1  ?p1  <http://www.wikidata.org/entity/Q1248784> . ?s1  <http://www.wikidata.org/prop/direct/P276>  <http://www.wikidata.org/entity/Q99> .  }\n",
      "pred sparql: select distinct  ?answer where  {   ?answer wdt:P931 wd:Q1248784 .  ?answer wdt:P31 wd:Q99  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 22\n",
      "question: How many grand-children did Jacques Cousteau have?\n",
      "ref sparql: SELECT (COUNT(DISTINCT ?uri) as ?count) WHERE { <http://www.wikidata.org/entity/Q83233> <http://www.wikidata.org/prop/direct/P40>/<http://www.wikidata.org/prop/direct/P40> ?uri }\n",
      "pred sparql: SELECT (COUNT(  ?obj) AS  ?value )  {  wd:Q83233 wdt:P1038  ?obj  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'value': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer', 'type': 'literal', 'value': '0'}}]\n",
      "\n",
      "id: 214\n",
      "question: Give me all professional skateboarders from Sweden.\n",
      "ref sparql:  SELECT ?s1 WHERE { ?s1  <http://www.wikidata.org/prop/direct/P641> <http://www.wikidata.org/entity/Q842284> . ?s1  <http://www.wikidata.org/prop/direct/P19> ?o1 . ?o1 <http://www.wikidata.org/prop/direct/P131>* <http://www.wikidata.org/entity/Q34> . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q842284 .  ?sbj wdt:P425 wd:Q34 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'all professional skateboarders from Sweden')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT\n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 210\n",
      "question: Which monarchs of the United Kingdom were married to a German?\n",
      "ref sparql: PREFIX p: <http://www.wikidata.org/prop/> PREFIX ps: <https://w3id.org/payswarm#> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX bd: <http://www.bigdata.com/rdf#> PREFIX wikibase: <http://wikiba.se/ontology#> SELECT DISTINCT ?uri WHERE { { ?uri ?allowed wd:Q9134365 . VALUES ?allowed { wdt:P39 wdt:P97 } } UNION { ?uri wdt:P39 ?position . VALUES ?position { wd:Q116 wd:Q12097  } ?uri p:P39/pq:P642 ?kingdom . } VALUES ?kingdom { wd:Q161885 wd:Q174193 } . ?uri wdt:P26 ?spouse . ?spouse wdt:P19/wdt:P17 wd:Q183 . }\n",
      "pred sparql: SELECT WHERE  {  wd:Q9134365 p:P26  ?s .  ?s ps:P26 wd:Q116 .  ?s pq:P26 wd:Q183  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 199\n",
      "question: Give me all Argentine films.\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri { ?uri wdt:P31 wd:Q11424 . ?uri wdt:P495 wd:Q414 }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q11424 .  ?sbj wdt:P155 wd:Q414 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'all Argentine films')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 203\n",
      "question: How did Michael Jackson die?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q2831> <http://www.wikidata.org/prop/direct/P509> ?uri . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q2831 wdt:P509  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q12152'}}]\n",
      "\n",
      "id: 197\n",
      "question: Which U.S. state has been admitted latest?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P31 wd:Q35657 . ?uri wdt:P571 ?date } ORDER BY DESC(?date) LIMIT 1\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q35657 wdt:P971  ?X .  ?X wdt:P1365  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 196\n",
      "question: Which classes does the Millepede belong to?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q11185669 wdt:P279 ?uri . }\n",
      "pred sparql: SELECT WHERE  {  wd:Q11185669 p:P361  ?s .  ?s ps:P361  ?obj  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 188\n",
      "question: Give me the homepage of Forbes.\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q25161472 wdt:P856 ?uri } \n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q25161472 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'homepage')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 187\n",
      "question: Who is the husband of Amanda Palmer?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P26 wd:Q240377 } \n",
      "pred sparql: select distinct  ?answer where  {   ?answer wdt:P26 wd:Q240377  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q210059'}}]\n",
      "\n",
      "id: 176\n",
      "question: Who painted The Storm on the Sea of Galilee?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q2246489 wdt:P170 ?uri } \n",
      "pred sparql: select distinct  ?answer where  {  wd:Q2246489 wdt:P170  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q5598'}}]\n",
      "\n",
      "id: 62\n",
      "question: What is the highest place of Karakoram?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q5469 wdt:P610 ?uri }\n",
      "pred sparql: select distinct  ?answer where  {   ?answer wdt:P610 wd:Q5469  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 168\n",
      "question: Which actors play in Big Bang Theory?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q8539> <http://www.wikidata.org/prop/direct/P161> ?uri}\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q8539 wdt:P161  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q103939'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q110154'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q120406'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q181900'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q190972'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q210200'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q229134'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q230335'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q230405'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q231093'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q231405'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q236189'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q236364'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q236711'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q236854'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q238843'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q240199'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q264699'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q265099'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q295739'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q299297'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q303192'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q310375'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q328409'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q339864'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q351156'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q358990'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q366403'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q429619'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q433417'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q442661'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q444480'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q445638'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q489831'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q522856'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q552176'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q552802'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q635974'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q718078'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q931654'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q978367'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q983229'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q1120939'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q1157743'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q1189095'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q1712385'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q2447922'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q2841058'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q2940994'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q3453757'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q3809587'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q4725713'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q5044233'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q5488124'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q16728666'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q16832120'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q23833725'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q16759'}}]\n",
      "\n",
      "id: 166\n",
      "question: Which computer scientist won an oscar?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P106> <http://www.wikidata.org/entity/Q82594> . ?uri <http://www.wikidata.org/prop/direct/P166> ?award . ?award <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q19020> . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q82594 wdt:P166  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 160\n",
      "question: Who wrote Harry Potter?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q8337> <http://www.wikidata.org/prop/direct/P50> ?uri}\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q8337 wdt:P50  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q34660'}}]\n",
      "\n",
      "id: 158\n",
      "question: Give me all writers that won the Nobel Prize in literature.\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q36180 ; wdt:P166 wd:Q37922 . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q36180 .  ?sbj wdt:P1346 wd:Q37922 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'nobelprize in literature')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 157\n",
      "question: Give me English actors starring in Lovesick.\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q12125895 wdt:P161 ?uri. ?uri wdt:P19 ?birthplace . ?birthplace wdt:P17 wd:Q145 . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q12125895 .  ?sbj wdt:P161 wd:Q145 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'Lovesick')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 150\n",
      "question: In which city was the president of Montenegro born?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q236> <http://www.wikidata.org/prop/direct/P35>/<http://www.wikidata.org/prop/direct/P19> ?uri . ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q515> . }\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q236 wdt:P19  ?X .  ?X wdt:P19 wd:Q515  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 149\n",
      "question: Which U.S. state has the highest population density?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT ?uri { ?uri wdt:P31 wd:Q35657 . ?uri wdt:P1082 ?population . ?uri wdt:P2046 ?area . BIND((?population/?area) AS ?density ) } ORDER BY DESC(?density) LIMIT 1\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q35657 wdt:P150  ?X .  ?X wdt:P1082  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 25\n",
      "question: What is the longest river in China?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q4022> . ?uri <http://www.wikidata.org/prop/direct/P17> <http://www.wikidata.org/entity/Q148> . ?uri <http://www.wikidata.org/prop/direct/P2043> ?length } ORDER BY DESC(?length) LIMIT 1\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q4022 wdt:P2918  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 143\n",
      "question: What is the area code of Berlin?\n",
      "ref sparql: SELECT DISTINCT ?string WHERE { <http://www.wikidata.org/entity/Q64> <http://www.wikidata.org/prop/direct/P473> ?string . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q64 wdt:P1894  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 140\n",
      "question: How many scientists graduated from an Ivy League university?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri wdt:P106 wd:Q901 . ?uri wdt:P69 ?university. wd:Q49113  wdt:P527 ?university . }\n",
      "pred sparql: SELECT (COUNT(  ?obj) AS  ?value )  {  wd:Q901 wdt:P69  ?obj .  ?obj wdt:P69 wd:Q49113  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'value': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer', 'type': 'literal', 'value': '0'}}]\n",
      "\n",
      "id: 139\n",
      "question: Which professional surfers were born in Australia?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri wdt:P19 ?birtplace . ?birtplace wdt:P17 wd:Q408 . ?uri wdt:P106 wd:Q13561328 . }\n",
      "pred sparql: SELECT (COUNT(  ?obj) AS  ?value )  {  wd:Q408 wdt:P19  ?obj .  ?obj wdt:P19 wd:Q13561328  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'value': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer', 'type': 'literal', 'value': '0'}}]\n",
      "\n",
      "id: 136\n",
      "question: How many moons does Mars have?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q111> <http://www.wikidata.org/prop/direct/P398> ?uri  . }\n",
      "pred sparql: SELECT (COUNT(  ?obj) AS  ?value )  {  wd:Q111 wdt:P398  ?obj  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'value': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer', 'type': 'literal', 'value': '16'}}]\n",
      "\n",
      "id: 134\n",
      "question: What is Batman's real name?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q2695156> <http://www.wikidata.org/prop/direct/P460> ?uri . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q2695156 wdt:P734  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q1295024'}}]\n",
      "\n",
      "id: 132\n",
      "question: What is Elon Musk famous for?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q317521> <http://www.wikidata.org/prop/direct/P61> ?uri . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q317521 wdt:P800  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 128\n",
      "question: Who is the author of WikiLeaks?\n",
      "ref sparql:  SELECT ?o1 WHERE { <http://www.wikidata.org/entity/Q359>  <http://www.wikidata.org/prop/direct/P50>  ?o1 .  }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q359 wdt:P50  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q360'}}]\n",
      "\n",
      "id: 124\n",
      "question: When was Carlo Giuliani shot?\n",
      "ref sparql:  SELECT ?o1 WHERE { <http://www.wikidata.org/entity/Q164791>  <http://www.wikidata.org/prop/direct/P570>  ?o1 .  }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q164791 wdt:P20  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 122\n",
      "question: Who was the wife of President Lincoln?\n",
      "ref sparql:  SELECT ?o1 WHERE { <http://www.wikidata.org/entity/Q91>  <http://www.wikidata.org/prop/direct/P26>  ?o1 .  }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q91 wdt:P26  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q215062'}}]\n",
      "\n",
      "id: 111\n",
      "question: How many awards has Bertrand Russell?\n",
      "ref sparql:  SELECT  (COUNT(DISTINCT ?o1) as ?count)  WHERE { <http://www.wikidata.org/entity/Q33760>  <http://www.wikidata.org/prop/direct/P166>  ?o1 . } \n",
      "pred sparql: SELECT (COUNT(  ?obj) AS  ?value )  {  wd:Q33760 wdt:P166  ?obj  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'value': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer', 'type': 'literal', 'value': '7'}}]\n",
      "\n",
      "id: 117\n",
      "question: Is Pamela Anderson a vegan?\n",
      "ref sparql: ASK where { <http://www.wikidata.org/entity/Q83325> <http://www.wikidata.org/prop/direct/P1576> <http://www.wikidata.org/entity/Q83364>}\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q83325 wdt:P676  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 59\n",
      "question: Which space probes were sent into orbit around the sun?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P522> <http://www.wikidata.org/entity/Q737809> . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q737809 wdt:P2375  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 113\n",
      "question: Which German cities have more than 250000 inhabitants?\n",
      "ref sparql:  SELECT ?s1 WHERE { ?s1  <http://www.wikidata.org/prop/direct/P17>  <http://www.wikidata.org/entity/Q183> .  ?s1 <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q515> .  ?s1  <http://www.wikidata.org/prop/direct/P1082>  ?o1 . FILTER ( ?o1 > \"250000\"^^<http://www.w3.org/2001/XMLSchema#integer>)}\n",
      "pred sparql: SELECT WHERE  {  wd:Q183 p:P1082  ?s .  ?s ps:P1082 wd:Q515 .  ?s pq:P1082  ?value  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 104\n",
      "question: Who is the daughter of Robert Kennedy married to?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q25310> <http://www.wikidata.org/prop/direct/P40> ?daughter . ?daughter  <http://www.wikidata.org/prop/direct/P21> <http://www.wikidata.org/entity/Q6581072> . ?daughter  <http://www.wikidata.org/prop/direct/P26> ?uri .}\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q25310 wdt:P26  ?X .  ?X wdt:P40 wd:Q6581072  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 10\n",
      "question: How many students does the Free University of Amsterdam have?\n",
      "ref sparql: SELECT ?o1 WHERE { <http://www.wikidata.org/entity/Q214341>  <http://www.wikidata.org/prop/direct/P2196>  ?o1 .  }\n",
      "pred sparql: SELECT (COUNT(  ?obj) AS  ?value )  {  wd:Q214341 wdt:P802  ?obj  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'value': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer', 'type': 'literal', 'value': '0'}}]\n",
      "\n",
      "id: 178\n",
      "question: How many James Bond movies do exist?\n",
      "ref sparql:  SELECT (COUNT(?s1) as ?c) WHERE { ?s1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q11424> . ?s1  ?p  <http://www.wikidata.org/entity/Q2009573> .  FILTER (?p = <http://www.wikidata.org/prop/direct/P144> || ?p = <http://www.wikidata.org/prop/direct/P674>) }\n",
      "pred sparql: SELECT (COUNT(  ?obj) AS  ?value )  {  wd:Q11424 wdt:P1080  ?obj .  ?obj wdt:P1080 wd:Q2009573  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'value': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer', 'type': 'literal', 'value': '0'}}]\n",
      "\n",
      "id: 129\n",
      "question: Who does the voice of Bart Simpson?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q5480> <http://www.wikidata.org/prop/direct/P725> ?uri }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q5480 wdt:P725  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 183\n",
      "question: Who was Tom Hanks married to?\n",
      "ref sparql: SELECT ?o1 WHERE { <http://www.wikidata.org/entity/Q2263>  <http://www.wikidata.org/prop/direct/P26>  ?o1 .  }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q2263 wdt:P26  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 181\n",
      "question: Through which countries does the Yenisei river flow?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q78707> <http://www.wikidata.org/prop/direct/P17> ?uri . }\n",
      "pred sparql: ASK WHERE  {  wd:Q78707 wdt:P17  ?obj  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " True\n",
      "\n",
      "id: 7\n",
      "question: Give me all cars that are produced in Germany.\n",
      "ref sparql: SELECT DISTINCT * WHERE { ?s1 <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q59773381> .  ?s1 <http://www.wikidata.org/prop/direct/P176> ?o1 . ?o1  <http://www.wikidata.org/prop/direct/P17>  <http://www.wikidata.org/entity/Q183> . ?o1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q786820> . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q59773381 .  ?sbj wdt:P1056 wd:Q183 .  ?sbj wdt:P1056 wd:Q786820 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'german')) . FILTER (lang(  ?s\n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 135\n",
      "question: When did Michael Jackson die?\n",
      "ref sparql:  SELECT ?o1 WHERE { <http://www.wikidata.org/entity/Q2831>  <http://www.wikidata.org/prop/direct/P570>  ?o1 .  } \n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q2831 wdt:P509  ?X .  ?X wdt:P570  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 50\n",
      "question: What is the highest volcano in Africa?\n",
      "ref sparql:  SELECT DISTINCT ?s1 WHERE { ?s1  <http://www.wikidata.org/prop/direct/P30>  <http://www.wikidata.org/entity/Q15> . ?s1  <http://www.wikidata.org/prop/direct/P31>/<http://www.wikidata.org/prop/direct/P279>*  <http://www.wikidata.org/entity/Q8072> . ?s1 <http://www.wikidata.org/prop/direct/P2044> ?o1 . } ORDER BY DESC(?o1) LIMIT 1\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q15 wdt:P610  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q1394606'}}]\n",
      "\n",
      "id: 39\n",
      "question: Which poet wrote the most books?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q49757 . ?x wdt:P50 ?uri ; wdt:P31 wd:Q571 . } GROUP BY ?uri ORDER BY DESC(COUNT(?x)) LIMIT 1\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q49757 wdt:P50  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 71\n",
      "question: Give me all spacecrafts that flew to Mars.\n",
      "ref sparql: SELECT ?s1 where  { ?s1 <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q389459> } \n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q389459 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'flew to Mars')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 213\n",
      "question: Show me all Czech movies.\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q11424> . { ?uri <http://www.wikidata.org/prop/direct/P495> <http://www.wikidata.org/entity/Q213> . } UNION { ?uri <http://www.wikidata.org/prop/direct/P495> <http://www.wikidata.org/entity/Q33946> . } }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q11424 .  ?sbj wdt:P1431 wd:Q213 .  ?sbj wdt:P31 wd:Q33946 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'Czech movies')) . FILTER (lang(  ?s\n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 105\n",
      "question: Which countries have more than ten volcanoes?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE {  { ?volcano <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q8072> . } UNION { ?volcano <http://www.wikidata.org/prop/direct/P31> ?type . ?type <http://www.wikidata.org/prop/direct/P279>* <http://www.wikidata.org/entity/Q8072> . } ?volcano <http://www.wikidata.org/prop/direct/P17> ?uri . } GROUP BY ?uri HAVING(COUNT(?volcano)>10)\n",
      "pred sparql: SELECT WHERE  {  wd:Q8072 p:P150  ?s .  ?s ps:P150 wd:Q8072 .  ?s pq:P995  ?value  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 52\n",
      "question: Give me all movies with Tom Cruise.\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P161 wd:Q37079. }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q37079 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'Tom Cruise')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 102\n",
      "question: When did Dracula's creator die?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT ?date WHERE { wd:Q3266236 wdt:P170 ?author . ?author wdt:P570 ?date }\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q3266236 wdt:P170  ?X .  ?X wdt:P570  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'answer': {'datatype': 'http://www.w3.org/2001/XMLSchema#dateTime', 'type': 'literal', 'value': '1912-04-20T00:00:00Z'}}]\n",
      "\n",
      "id: 21\n",
      "question: Who created English Wikipedia?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q52 wdt:P170 ?uri . ?uri wdt:P31 wd:Q5 . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q52 wdt:P170  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q56035565'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q181'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q185'}}]\n",
      "\n",
      "id: 34\n",
      "question: Give me all female German chancellors.\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P21 wd:Q6581072 . ?uri wdt:P39 wd:Q4970706 . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q6581072 .  ?sbj wdt:P21 wd:Q4970706 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'all female German chancellors')) . FILTER (lang(  ?sbj_label) = 'en')  } \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 145\n",
      "question: Who owns Aldi?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q125054 wdt:P355 ?uri }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q125054 wdt:P1830  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 154\n",
      "question: Which books were written by Danielle Steel?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P50 wd:Q72653 . ?uri wdt:P136 ?genre . ?genre wdt:P279* wd:Q571 . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q72653 wdt:P50  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 198\n",
      "question: Who was influenced by Socrates?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT * WHERE { ?uri wdt:P31 wd:Q5 . ?uri wdt:P737 wd:Q913 . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q5 wdt:P737  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 162\n",
      "question: How deep is Lake Chiemsee?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?n WHERE { wd:Q4138  wdt:P4511 ?n }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q4138 wdt:P1589  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 96\n",
      "question: Which professional surfers were born on the Philippines?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT * WHERE { ?uri wdt:P19 ?birtplace . ?birtplace wdt:P17 wd:Q928 . ?uri wdt:P106  wd:Q13561328 . }\n",
      "pred sparql: SELECT WHERE  {  wd:Q928 p:P19  ?s .  ?s ps:P19 wd:Q13561328 .  ?s pq:P31  ?value  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 40\n",
      "question: Who were the parents of Queen Victoria?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT ?uri WHERE { wd:Q9439 ?childof ?uri . VALUES ?childof { wdt:P22 wdt:P25 }}\n",
      "pred sparql: select distinct  ?answer where  {   ?answer wdt:P25 wd:Q9439  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q116728'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q155566'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q158143'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q158140'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q160539'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q160541'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q160558'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q161167'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q20875'}}]\n",
      "\n",
      "id: 79\n",
      "question: Are there any castles in the United States?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> ASK WHERE { { ?uri wdt:P31 wd:Q23413. } UNION { ?uri wdt:P31 ?castlesubtype . ?castlesubtype wdt:P279* wd:Q23413 } ?uri wdt:P17 wd:Q30 }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q23413 wdt:PCastles wdt:P31 wd:Q30  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 141\n",
      "question: Which languages are spoken in Estonia?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT * WHERE { wd:Q191 wdt:P2936 ?lang . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q191 wdt:P1412  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 80\n",
      "question: Give me a list of all critically endangered birds.\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P171>* <http://www.wikidata.org/entity/Q5113> . ?uri <http://www.wikidata.org/prop/direct/P141> <http://www.wikidata.org/entity/Q219127> . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q5113 .  ?sbj wdt:P1990 wd:Q219127 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'critically endangered birds')) . FILTER (lang(  ?sbj_label) = 'en')  } \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 159\n",
      "question: Which countries are connected by the Rhine?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri ?x ?y  WHERE { wd:Q584  wdt:P17 ?uri . ?uri wdt:P31 wd:Q6256 . } \n",
      "pred sparql: select distinct  ?answer where  {   ?answer wdt:P2789 wd:Q584 .  ?answer wdt:P31 wd:Q6256  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 163\n",
      "question: Give me all chemical elements.\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q11344 . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q11344 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'chemical elements')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 211\n",
      "question: Give me all American presidents of the last 20 years.\n",
      "ref sparql: PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX p: <http://www.wikidata.org/prop/> SELECT DISTINCT ?uri WHERE { ?uri p:P39 ?position . ?position ps:P39 wd:Q11696 . ?position pq:P582 ?termEnd. FILTER((YEAR(NOW()) - YEAR(?termEnd)) <= 20) }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q11696 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'all American presidents of the last 20 years')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 51\n",
      "question: When is the movie Worst Case Scenario going to be in cinemas in the Netherlands?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?date WHERE { wd:Q6667101 wdt:P577 ?date }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q6667101 wdt:P1434  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 144\n",
      "question: Whom did Lance Bass marry?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q443120> <http://www.wikidata.org/prop/direct/P26> ?uri . }\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q443120 wdt:P26  ?X .  ?X wdt:P26  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q443120'}}]\n",
      "\n",
      "id: 131\n",
      "question: What languages are spoken in Pakistan?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT * { wd:Q843 wdt:P2936 ?uri . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q843 wdt:P1412  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 120\n",
      "question: Who is the daughter of Bill Clinton married to?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT * { wd:Q1124 wdt:P40 ?child . ?child wdt:P26 ?uri }\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q1124 wdt:P26  ?X .  ?X wdt:P40  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q229671'}}]\n",
      "\n",
      "id: 164\n",
      "question: Who was on the Apollo 11 mission?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q43653> <http://www.wikidata.org/prop/direct/P1029> ?uri}\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q43653 wdt:P450  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 151\n",
      "question: Give me all B-sides of the Ramones.\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> SELECT ?res WHERE { ?res wdt:P175 wd:Q483407 . ?res p:P1433 _:a ._:a pq:P2868 wd:Q13432985 . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q483407 .  ?sbj wdt:P1432 wd:Q13432985 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'Ramones')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 63\n",
      "question: Who was called Scarface?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri { ?uri wdt:P1449 ?nickname . FILTER REGEX(STR(?nickname), \"^Scarface$\") }\n",
      "pred sparql: select distinct  ?answer where  {  wd: Scarface wdt:P1449  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 27\n",
      "question: Which rivers flow into the North Sea?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q4022> . ?uri <http://www.wikidata.org/prop/direct/P403> <http://www.wikidata.org/entity/Q1693> . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q4022 wdt:P200  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 156\n",
      "question: Where is Fort Knox located?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri { wd:Q8962067 wdt:P131+ ?uri . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q8962067 wdt:P276  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 207\n",
      "question: Which daughters of British earls died at the same place they were born at?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri { ?uri wdt:P19 ?birthplace . ?uri wdt:P20 ?deathplace . FILTER(?birthplace = ?deathplace) ?uri wdt:P21 wd:Q6581072 . ?uri wdt:P22 ?father . ?father wdt:P97/wdt:P460 wd:Q1128240. ?father wdt:P27*/wdt:P1366*/wdt:P706* wd:Q38272 . }\n",
      "pred sparql: SELECT WHERE  {  wd:Q6581072 p:P20  ?s .  ?s ps:P20 wd:Q1128240 .  ?s pq:P19 wd:Q38272  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 13\n",
      "question: Which politicians were married to a German?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P106> <http://www.wikidata.org/entity/Q82955> . ?uri <http://www.wikidata.org/prop/direct/P26> ?spouse . { ?spouse <http://www.wikidata.org/prop/direct/P27> <http://www.wikidata.org/entity/Q183> . } UNION { ?spouse <http://www.wikidata.org/prop/direct/P19>/<http://www.wikidata.org/prop/direct/P17> <http://www.wikidata.org/entity/Q183> } } \n",
      "pred sparql: SELECT WHERE  {  wd:Q82955 p:P26  ?s .  ?s ps:P26 wd:Q183 .  ?s pq:P26 wd:Q183  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 114\n",
      "question: How big is the earth's diameter?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?c WHERE { wd:Q2 wdt:P2386 ?c. }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q2 wdt:P2386  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'answer': {'datatype': 'http://www.w3.org/2001/XMLSchema#decimal', 'type': 'literal', 'value': '12742'}}]\n",
      "\n",
      "id: 92\n",
      "question: Is the wife of President Obama called Michelle?\n",
      "ref sparql: PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q76 wdt:P26 ?obj . ?obj rdfs:label ?label FILTER( REGEX( ?label, \"Michelle\" ) ) }\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q76 wdt:P26  ?X .  ?X wdt:P735  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q15621047'}}]\n",
      "\n",
      "id: 194\n",
      "question: Which U.S. state has the abbreviation MN?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q35657 . ?uri wdt:P1813 ?name . FILTER( REGEX( ?name, \"^MN$\")) } \n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q35657 wdt:P281  ?X .  ?X wdt:P1813  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 60\n",
      "question: Who is the governor of Texas?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q1439 wdt:P1313 wd:Q5589725 . wd:Q5589725 wdt:P1308 ?uri . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q1439 wdt:P6  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q5605224'}}]\n",
      "\n",
      "id: 110\n",
      "question: Which movies did Kurosawa direct?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT * WHERE { ?uri wdt:P57 wd:Q8006 . } \n",
      "pred sparql: SELECT WHERE  {  wd:Q8006 p:P57  ?s .  ?s ps:P57  ?obj  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 206\n",
      "question: What was the name of the famous battle in 1836 in San Antonio?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P276 wd:Q975 . ?uri wdt:P31 wd:Q178561 . ?uri wdt:P585 ?time . FILTER( YEAR(?time) = 1836 ) } \n",
      "pred sparql: select distinct  ?answer where  {  wd:Q975 wdt:P1635  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 97\n",
      "question: Give me the official websites of actors of the television show Charmed.\n",
      "ref sparql: PREFIX p: <http://www.wikidata.org/prop/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q162371 p:P161/ps:P161/wdt:P856 ?uri . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q162371 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'Charmed')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 169\n",
      "question: Give me all libraries established before 1400.\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT * WHERE { ?uri wdt:P31/wdt:P279* wd:Q7075 . ?uri wdt:P571 ?date . FILTER( YEAR(?date) < 1400 ) } \n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q7075 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), '1400')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 38\n",
      "question: Give me all Frisian islands that belong to the Netherlands.\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { { wd:Q76936 wdt:P527+ ?uri . } UNION { wd:Q76936 wdt:P527* ?islandgroup . ?uri wdt:P361+ ?islandgroup . } ?uri wdt:P17 wd:Q55 . ?uri wdt:P31 wd:Q23442 . } \n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q76936 .  ?sbj wdt:P127 wd:Q55 .  ?sbj wdt:P127 wd:Q23442 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'the Netherlands')) . FILTER (lang(  ?s\n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 192\n",
      "question: Which museum exhibits The Scream by Munch?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q471379> <http://www.wikidata.org/prop/direct/P527>/<http://www.wikidata.org/prop/direct/P276> ?uri . ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q207694>}\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q471379 wdt:P1436  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 78\n",
      "question: When was the De Beers company founded?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT ?date WHERE { wd:Q471891 wdt:P571 ?date . } \n",
      "pred sparql: select distinct  ?answer where  {  wd:Q471891 wdt:P112  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q19825'}}]\n",
      "\n",
      "id: 19\n",
      "question: Who became president after JFK died?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q9696> <http://www.wikidata.org/prop/P39> ?position . ?position  <http://www.wikidata.org/prop/statement/P39> <http://www.wikidata.org/entity/Q11696> . ?position <http://www.wikidata.org/prop/qualifier/P1366> ?uri . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q9696 wdt:P35  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 174\n",
      "question: Who is the novelist of the work a song of ice and fire?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q45875 ?p ?uri . ?uri wdt:P106 wd:Q6625963 . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q45875 wdt:P1441  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 189\n",
      "question: In which studio did the Beatles record their first album?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?album wdt:P31 wd:Q482994 ; wdt:P175 wd:Q1299 ; wdt:P577 ?date ; wdt:P483 ?uri . } ORDER BY ?date LIMIT 1\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q482994 wdt:P483  ?X .  ?X wdt:P483 wd:Q1299  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 152\n",
      "question: Which beer brewing companies are located in North-Rhine Westphalia?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q131734 . ?uri wdt:P159*/wdt:P31*/wdt:P131 wd:Q1198 . } \n",
      "pred sparql: SELECT WHERE  {  wd:Q131734 p:P355  ?s .  ?s ps:P355 wd:Q1198 .  ?s pq:P276  ?value  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 94\n",
      "question: When did princess Diana die?\n",
      "ref sparql: SELECT DISTINCT ?date WHERE { <http://www.wikidata.org/entity/Q9685> <http://www.wikidata.org/prop/direct/P570> ?date  . }\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q9685 wdt:P570  ?X .  ?X wdt:P570  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 8\n",
      "question: Who founded Intel?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q248 wdt:P112 ?uri . }  \n",
      "pred sparql: select distinct  ?answer where  {  wd:Q248 wdt:P112  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q241735'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q243969'}}, {'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q432929'}}]\n",
      "\n",
      "id: 95\n",
      "question: Who is the youngest player in the Premier League?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?team wdt:P118 wd:Q9448 . ?uri wdt:P54 ?team ; wdt:P569 ?dateOfBirth . } ORDER BY DESC(?dateOfBirth) LIMIT 1\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q9448 wdt:P19  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 119\n",
      "question: Which instruments does Cat Stevens play?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q154216> <http://www.wikidata.org/prop/direct/P1303> ?uri . } \n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q154216 wdt:P1303  ?X .  ?X wdt:P1303  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 115\n",
      "question: How many rivers and lakes are in South Carolina?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(?uri) AS ?c) WHERE { ?uri wdt:P131 wd:Q1456 . ?uri wdt:P31/wdt:P279* wd:Q23397 . }\n",
      "pred sparql: SELECT (COUNT(  ?obj) AS  ?value )  {  wd:Q1456 wdt:P200  ?obj .  ?obj wdt:P206 wd:Q23397  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'value': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer', 'type': 'literal', 'value': '0'}}]\n",
      "\n",
      "id: 116\n",
      "question: Who was called Rodzilla?\n",
      "ref sparql: PREFIX skos: <http://www.w3.org/2004/02/skos/core#> SELECT * WHERE { ?uri skos:altLabel \"Rodzilla\"@en . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:select  ?answer wdt:P1449  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 138\n",
      "question: Give me the capitals of all countries in Africa.\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?country <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q6256> . ?country  <http://www.wikidata.org/prop/direct/P30> <http://www.wikidata.org/entity/Q15> . ?country <http://www.wikidata.org/prop/direct/P36> ?uri . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q6256 .  ?sbj wdt:P36 wd:Q15 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'all capitals of all countries in Africa')) . FILTER (lang(  ?sbj_label) = 'en')  } \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 177\n",
      "question: Which bridges are of the same type as the Manhattan Bridge?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri { wd:Q125050 wdt:P31 ?type . ?uri wdt:P31 ?type . ?uri wdt:P31/wdt:P279* wd:Q12280 . FILTER( ?type != wd:Q12280 ) }\n",
      "pred sparql: SELECT WHERE  {  wd:Q125050 p:P177  ?s .  ?s ps:P177 wd:Q12280 .  ?s pq:P179  ?value  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 87\n",
      "question: Which book has the most pages?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q571 . ?uri wdt:P1104 ?number . } ORDER BY DESC(?number) LIMIT 1\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q571 wdt:P1104  ?X .  ?X wdt:P1104  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 148\n",
      "question: What is the largest state in the United States?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q35657 . ?uri wdt:P2046 ?area . } ORDER BY DESC(?area) LIMIT 1\n",
      "pred sparql: select distinct  ?answer where  {   ?answer wdt:P150 wd:Q35657  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 43\n",
      "question: Give me the websites of companies with more than 500000 employees.\n",
      "ref sparql: SELECT DISTINCT ?string WHERE { ?uri <http://www.wikidata.org/prop/direct/P31>/(<http://www.wikidata.org/prop/direct/P279>*) <http://www.wikidata.org/entity/Q4830453> . ?uri <http://www.wikidata.org/prop/direct/P1128> ?number . FILTER(?number > 500000) . ?uri <http://www.wikidata.org/prop/direct/P856> ?string . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q4830453 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), '500000')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 179\n",
      "question: What were the names of the three ships by Columbus?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q11446 . ?uri wdt:P1344/wdt:P710 wd:Q7322 . } \n",
      "pred sparql: select distinct  ?answer where  {  wd:Q11446 wdt:P734  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "101 SPARQL queries don't give an answer\n"
     ]
    }
   ],
   "source": [
    "counter = 0\n",
    "\n",
    "for ref, pred in zip(ref_ques_list, pred_ques_list):\n",
    "    ques_pair = Ques_pair(ref, pred)\n",
    "    if ques_pair.ref_answer==[]:\n",
    "        ques_pair.print(print_answer=True)\n",
    "        counter += 1\n",
    "\n",
    "print(str(counter) + \" SPARQL queries don't give an answer\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "id: 86\n",
      "question: What is the highest mountain in Germany?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P31 wd:Q8502 ; wdt:P2044 ?elevation ; wdt:P17 wd:Q183 . } ORDER BY DESC(?elevation) LIMIT 1\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q8502 wdt:P610  ?answer  }  \n",
      "\n",
      "id: 84\n",
      "question: Which American presidents were in office during the Vietnam War?\n",
      "ref sparql: SELECT DISTINCT ?o WHERE { <http://www.wikidata.org/entity/Q8740>  <http://www.wikidata.org/prop/direct/P580>  ?startWar . <http://www.wikidata.org/entity/Q8740>  <http://www.wikidata.org/prop/direct/P582>  ?endWar . <http://www.wikidata.org/entity/Q30>  <http://www.wikidata.org/prop/P6> ?blank . ?blank <http://www.wikidata.org/prop/statement/P6> ?o . ?blank <http://www.wikidata.org/prop/qualifier/P580> ?start . ?blank <http://www.wikidata.org/prop/qualifier/P582> ?end . FILTER (?startWar < ?start && ?endWar > ?end)} \n",
      "pred sparql: select distinct  ?answer where  {  wd:Q8740 wdt:P1308  ?answer  }  \n",
      "\n",
      "id: 81\n",
      "question: Butch Otter is the governor of which U.S. state?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT ?res WHERE { ?res wdt:P6 wd:Q39593 . }\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q39593 wdt:P35  ?X .  ?X wdt:P35  ?answer  }  \n",
      "\n",
      "id: 66\n",
      "question: Which artists were born on the same date as Rachel Stevens?\n",
      "ref sparql:  SELECT ?s WHERE { <http://www.wikidata.org/entity/Q241665>  <http://www.wikidata.org/prop/direct/P569>  ?date . ?s <http://www.wikidata.org/prop/direct/P106> / <http://www.wikidata.org/prop/direct/P279>*   <http://www.wikidata.org/entity/Q483501> . ?s  <http://www.wikidata.org/prop/direct/P569>  ?date . }\n",
      "pred sparql: SELECT WHERE  {  wd:Q241665 p:P569  ?s .  ?s ps:P569 wd:Q483501 .  ?s pq:P569  ?value  }  \n",
      "\n",
      "id: 49\n",
      "question: Which frequent flyer program has the most airlines?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX ps: <http://www.wikidata.org/prop/statement/> SELECT ?frequentflyer WHERE { ?airlines wdt:P31 wd:Q46970 . ?airlines p:P4446/ps:P4446 ?frequentflyer . }  GROUP BY ?frequentflyer ORDER BY DESC(COUNT(?airlines)) LIMIT 1\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q46970 wdt:P5390  ?X .  ?X wdt:P113  ?answer  }  \n",
      "\n",
      "id: 44\n",
      "question: Which European countries have a constitutional monarchy?\n",
      "ref sparql:  SELECT ?o1 WHERE { <http://www.wikidata.org/entity/Q458>  <http://www.wikidata.org/prop/direct/P150>  ?o1 . ?o1 <http://www.wikidata.org/prop/direct/P122>   <http://www.wikidata.org/entity/Q41614> }\n",
      "pred sparql: SELECT WHERE  {  wd:Q458 p:P150  ?s .  ?s ps:P150 wd:Q41614 .  ?s pq:P31  ?value  }  \n",
      "\n",
      "id: 42\n",
      "question: Which countries have places with more than two caves?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?cave wdt:P31 wd:Q35509 ; wdt:P17 ?uri . } GROUP BY ?uri HAVING (COUNT(?cave) > 2)\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q35509 wdt:P276  ?X .  ?X wdt:P150  ?answer  }  \n",
      "\n",
      "id: 4\n",
      "question: Which airports are located in California, USA?\n",
      "ref sparql: SELECT DISTINCT ?s1 WHERE { ?s1  ?p1  <http://www.wikidata.org/entity/Q1248784> . ?s1  <http://www.wikidata.org/prop/direct/P276>  <http://www.wikidata.org/entity/Q99> .  }\n",
      "pred sparql: select distinct  ?answer where  {   ?answer wdt:P931 wd:Q1248784 .  ?answer wdt:P31 wd:Q99  }  \n",
      "\n",
      "id: 29\n",
      "question: Which countries in the European Union adopted the Euro?\n",
      "ref sparql:  SELECT DISTINCT ?s1 WHERE { <http://www.wikidata.org/entity/Q458>  <http://www.wikidata.org/prop/direct/P150>  ?s1 .  ?s1  <http://www.wikidata.org/prop/direct/P38>  <http://www.wikidata.org/entity/Q4916> . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q458 wdt:P467  ?answer  }  \n",
      "\n",
      "id: 214\n",
      "question: Give me all professional skateboarders from Sweden.\n",
      "ref sparql:  SELECT ?s1 WHERE { ?s1  <http://www.wikidata.org/prop/direct/P641> <http://www.wikidata.org/entity/Q842284> . ?s1  <http://www.wikidata.org/prop/direct/P19> ?o1 . ?o1 <http://www.wikidata.org/prop/direct/P131>* <http://www.wikidata.org/entity/Q34> . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q842284 .  ?sbj wdt:P425 wd:Q34 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'all professional skateboarders from Sweden')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT\n",
      "\n",
      "id: 210\n",
      "question: Which monarchs of the United Kingdom were married to a German?\n",
      "ref sparql: PREFIX p: <http://www.wikidata.org/prop/> PREFIX ps: <https://w3id.org/payswarm#> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX bd: <http://www.bigdata.com/rdf#> PREFIX wikibase: <http://wikiba.se/ontology#> SELECT DISTINCT ?uri WHERE { { ?uri ?allowed wd:Q9134365 . VALUES ?allowed { wdt:P39 wdt:P97 } } UNION { ?uri wdt:P39 ?position . VALUES ?position { wd:Q116 wd:Q12097  } ?uri p:P39/pq:P642 ?kingdom . } VALUES ?kingdom { wd:Q161885 wd:Q174193 } . ?uri wdt:P26 ?spouse . ?spouse wdt:P19/wdt:P17 wd:Q183 . }\n",
      "pred sparql: SELECT WHERE  {  wd:Q9134365 p:P26  ?s .  ?s ps:P26 wd:Q116 .  ?s pq:P26 wd:Q183  }  \n",
      "\n",
      "id: 199\n",
      "question: Give me all Argentine films.\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri { ?uri wdt:P31 wd:Q11424 . ?uri wdt:P495 wd:Q414 }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q11424 .  ?sbj wdt:P155 wd:Q414 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'all Argentine films')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "\n",
      "id: 197\n",
      "question: Which U.S. state has been admitted latest?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P31 wd:Q35657 . ?uri wdt:P571 ?date } ORDER BY DESC(?date) LIMIT 1\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q35657 wdt:P971  ?X .  ?X wdt:P1365  ?answer  }  \n",
      "\n",
      "id: 196\n",
      "question: Which classes does the Millepede belong to?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q11185669 wdt:P279 ?uri . }\n",
      "pred sparql: SELECT WHERE  {  wd:Q11185669 p:P361  ?s .  ?s ps:P361  ?obj  }  \n",
      "\n",
      "id: 188\n",
      "question: Give me the homepage of Forbes.\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q25161472 wdt:P856 ?uri } \n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q25161472 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'homepage')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "\n",
      "id: 62\n",
      "question: What is the highest place of Karakoram?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q5469 wdt:P610 ?uri }\n",
      "pred sparql: select distinct  ?answer where  {   ?answer wdt:P610 wd:Q5469  }  \n",
      "\n",
      "id: 166\n",
      "question: Which computer scientist won an oscar?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P106> <http://www.wikidata.org/entity/Q82594> . ?uri <http://www.wikidata.org/prop/direct/P166> ?award . ?award <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q19020> . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q82594 wdt:P166  ?answer  }  \n",
      "\n",
      "id: 158\n",
      "question: Give me all writers that won the Nobel Prize in literature.\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q36180 ; wdt:P166 wd:Q37922 . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q36180 .  ?sbj wdt:P1346 wd:Q37922 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'nobelprize in literature')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "\n",
      "id: 157\n",
      "question: Give me English actors starring in Lovesick.\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q12125895 wdt:P161 ?uri. ?uri wdt:P19 ?birthplace . ?birthplace wdt:P17 wd:Q145 . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q12125895 .  ?sbj wdt:P161 wd:Q145 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'Lovesick')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "\n",
      "id: 150\n",
      "question: In which city was the president of Montenegro born?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q236> <http://www.wikidata.org/prop/direct/P35>/<http://www.wikidata.org/prop/direct/P19> ?uri . ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q515> . }\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q236 wdt:P19  ?X .  ?X wdt:P19 wd:Q515  }  \n",
      "\n",
      "id: 149\n",
      "question: Which U.S. state has the highest population density?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT ?uri { ?uri wdt:P31 wd:Q35657 . ?uri wdt:P1082 ?population . ?uri wdt:P2046 ?area . BIND((?population/?area) AS ?density ) } ORDER BY DESC(?density) LIMIT 1\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q35657 wdt:P150  ?X .  ?X wdt:P1082  ?answer  }  \n",
      "\n",
      "id: 25\n",
      "question: What is the longest river in China?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q4022> . ?uri <http://www.wikidata.org/prop/direct/P17> <http://www.wikidata.org/entity/Q148> . ?uri <http://www.wikidata.org/prop/direct/P2043> ?length } ORDER BY DESC(?length) LIMIT 1\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q4022 wdt:P2918  ?answer  }  \n",
      "\n",
      "id: 143\n",
      "question: What is the area code of Berlin?\n",
      "ref sparql: SELECT DISTINCT ?string WHERE { <http://www.wikidata.org/entity/Q64> <http://www.wikidata.org/prop/direct/P473> ?string . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q64 wdt:P1894  ?answer  }  \n",
      "\n",
      "id: 137\n",
      "question: Give me all Dutch parties.\n",
      "ref sparql:  SELECT ?s1 WHERE { ?s1  <http://www.wikidata.org/prop/direct/P17> <http://www.wikidata.org/entity/Q55> . ?s1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q7278> .  } \n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q55 .  ?sbj wdt:P102 wd:Q7278 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'all Dutch parties')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "\n",
      "id: 132\n",
      "question: What is Elon Musk famous for?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q317521> <http://www.wikidata.org/prop/direct/P61> ?uri . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q317521 wdt:P800  ?answer  }  \n",
      "\n",
      "id: 124\n",
      "question: When was Carlo Giuliani shot?\n",
      "ref sparql:  SELECT ?o1 WHERE { <http://www.wikidata.org/entity/Q164791>  <http://www.wikidata.org/prop/direct/P570>  ?o1 .  }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q164791 wdt:P20  ?answer  }  \n",
      "\n",
      "id: 117\n",
      "question: Is Pamela Anderson a vegan?\n",
      "ref sparql: ASK where { <http://www.wikidata.org/entity/Q83325> <http://www.wikidata.org/prop/direct/P1576> <http://www.wikidata.org/entity/Q83364>}\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q83325 wdt:P676  ?answer  }  \n",
      "\n",
      "id: 59\n",
      "question: Which space probes were sent into orbit around the sun?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P522> <http://www.wikidata.org/entity/Q737809> . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q737809 wdt:P2375  ?answer  }  \n",
      "\n",
      "id: 113\n",
      "question: Which German cities have more than 250000 inhabitants?\n",
      "ref sparql:  SELECT ?s1 WHERE { ?s1  <http://www.wikidata.org/prop/direct/P17>  <http://www.wikidata.org/entity/Q183> .  ?s1 <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q515> .  ?s1  <http://www.wikidata.org/prop/direct/P1082>  ?o1 . FILTER ( ?o1 > \"250000\"^^<http://www.w3.org/2001/XMLSchema#integer>)}\n",
      "pred sparql: SELECT WHERE  {  wd:Q183 p:P1082  ?s .  ?s ps:P1082 wd:Q515 .  ?s pq:P1082  ?value  }  \n",
      "\n",
      "id: 104\n",
      "question: Who is the daughter of Robert Kennedy married to?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q25310> <http://www.wikidata.org/prop/direct/P40> ?daughter . ?daughter  <http://www.wikidata.org/prop/direct/P21> <http://www.wikidata.org/entity/Q6581072> . ?daughter  <http://www.wikidata.org/prop/direct/P26> ?uri .}\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q25310 wdt:P26  ?X .  ?X wdt:P40 wd:Q6581072  }  \n",
      "\n",
      "id: 1\n",
      "question: What is the revenue of IBM?\n",
      "ref sparql:  SELECT ?o1 WHERE { <http://www.wikidata.org/entity/Q37156>  <http://www.wikidata.org/prop/direct/P2139>  ?o1 .  }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q37156 wdt:P2139  ?answer  }  \n",
      "\n",
      "id: 129\n",
      "question: Who does the voice of Bart Simpson?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q5480> <http://www.wikidata.org/prop/direct/P725> ?uri }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q5480 wdt:P725  ?answer  }  \n",
      "\n",
      "id: 183\n",
      "question: Who was Tom Hanks married to?\n",
      "ref sparql: SELECT ?o1 WHERE { <http://www.wikidata.org/entity/Q2263>  <http://www.wikidata.org/prop/direct/P26>  ?o1 .  }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q2263 wdt:P26  ?answer  }  \n",
      "\n",
      "id: 7\n",
      "question: Give me all cars that are produced in Germany.\n",
      "ref sparql: SELECT DISTINCT * WHERE { ?s1 <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q59773381> .  ?s1 <http://www.wikidata.org/prop/direct/P176> ?o1 . ?o1  <http://www.wikidata.org/prop/direct/P17>  <http://www.wikidata.org/entity/Q183> . ?o1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q786820> . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q59773381 .  ?sbj wdt:P1056 wd:Q183 .  ?sbj wdt:P1056 wd:Q786820 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'german')) . FILTER (lang(  ?s\n",
      "\n",
      "id: 135\n",
      "question: When did Michael Jackson die?\n",
      "ref sparql:  SELECT ?o1 WHERE { <http://www.wikidata.org/entity/Q2831>  <http://www.wikidata.org/prop/direct/P570>  ?o1 .  } \n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q2831 wdt:P509  ?X .  ?X wdt:P570  ?answer  }  \n",
      "\n",
      "id: 39\n",
      "question: Which poet wrote the most books?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q49757 . ?x wdt:P50 ?uri ; wdt:P31 wd:Q571 . } GROUP BY ?uri ORDER BY DESC(COUNT(?x)) LIMIT 1\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q49757 wdt:P50  ?answer  }  \n",
      "\n",
      "id: 71\n",
      "question: Give me all spacecrafts that flew to Mars.\n",
      "ref sparql: SELECT ?s1 where  { ?s1 <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q389459> } \n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q389459 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'flew to Mars')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "\n",
      "id: 213\n",
      "question: Show me all Czech movies.\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q11424> . { ?uri <http://www.wikidata.org/prop/direct/P495> <http://www.wikidata.org/entity/Q213> . } UNION { ?uri <http://www.wikidata.org/prop/direct/P495> <http://www.wikidata.org/entity/Q33946> . } }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q11424 .  ?sbj wdt:P1431 wd:Q213 .  ?sbj wdt:P31 wd:Q33946 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'Czech movies')) . FILTER (lang(  ?s\n",
      "\n",
      "id: 209\n",
      "question: Give me all taikonauts.\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q11631 . ?uri wdt:P27 wd:Q148 . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q11631 .  ?sbj wdt:P31 wd:Q148 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'taikonauts')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "\n",
      "id: 105\n",
      "question: Which countries have more than ten volcanoes?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE {  { ?volcano <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q8072> . } UNION { ?volcano <http://www.wikidata.org/prop/direct/P31> ?type . ?type <http://www.wikidata.org/prop/direct/P279>* <http://www.wikidata.org/entity/Q8072> . } ?volcano <http://www.wikidata.org/prop/direct/P17> ?uri . } GROUP BY ?uri HAVING(COUNT(?volcano)>10)\n",
      "pred sparql: SELECT WHERE  {  wd:Q8072 p:P150  ?s .  ?s ps:P150 wd:Q8072 .  ?s pq:P995  ?value  }  \n",
      "\n",
      "id: 52\n",
      "question: Give me all movies with Tom Cruise.\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P161 wd:Q37079. }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q37079 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'Tom Cruise')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "\n",
      "id: 34\n",
      "question: Give me all female German chancellors.\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P21 wd:Q6581072 . ?uri wdt:P39 wd:Q4970706 . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q6581072 .  ?sbj wdt:P21 wd:Q4970706 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'all female German chancellors')) . FILTER (lang(  ?sbj_label) = 'en')  } \n",
      "\n",
      "id: 145\n",
      "question: Who owns Aldi?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q125054 wdt:P355 ?uri }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q125054 wdt:P1830  ?answer  }  \n",
      "\n",
      "id: 154\n",
      "question: Which books were written by Danielle Steel?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P50 wd:Q72653 . ?uri wdt:P136 ?genre . ?genre wdt:P279* wd:Q571 . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q72653 wdt:P50  ?answer  }  \n",
      "\n",
      "id: 198\n",
      "question: Who was influenced by Socrates?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT * WHERE { ?uri wdt:P31 wd:Q5 . ?uri wdt:P737 wd:Q913 . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q5 wdt:P737  ?answer  }  \n",
      "\n",
      "id: 162\n",
      "question: How deep is Lake Chiemsee?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?n WHERE { wd:Q4138  wdt:P4511 ?n }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q4138 wdt:P1589  ?answer  }  \n",
      "\n",
      "id: 212\n",
      "question: Which companies work in the aerospace industry as well as in medicine?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE {  ?type wdt:P279* wd:Q4830453 . ?aerospace wdt:P279* wd:Q3477363 . ?healthcare wdt:P279* wd:Q15067276 . ?pharma wdt:P279* wd:Q507443 . ?uri wdt:P452 ?aerospace ; wdt:P452 ?healthcare . }\n",
      "pred sparql: SELECT WHERE  {  wd:Q4830453 p:P452  ?s .  ?s ps:P452 wd:Q3477363 .  ?s pq:P452 wd:Q507443  }  \n",
      "\n",
      "id: 96\n",
      "question: Which professional surfers were born on the Philippines?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT * WHERE { ?uri wdt:P19 ?birtplace . ?birtplace wdt:P17 wd:Q928 . ?uri wdt:P106  wd:Q13561328 . }\n",
      "pred sparql: SELECT WHERE  {  wd:Q928 p:P19  ?s .  ?s ps:P19 wd:Q13561328 .  ?s pq:P31  ?value  }  \n",
      "\n",
      "id: 79\n",
      "question: Are there any castles in the United States?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> ASK WHERE { { ?uri wdt:P31 wd:Q23413. } UNION { ?uri wdt:P31 ?castlesubtype . ?castlesubtype wdt:P279* wd:Q23413 } ?uri wdt:P17 wd:Q30 }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q23413 wdt:PCastles wdt:P31 wd:Q30  }  \n",
      "\n",
      "id: 141\n",
      "question: Which languages are spoken in Estonia?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT * WHERE { wd:Q191 wdt:P2936 ?lang . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q191 wdt:P1412  ?answer  }  \n",
      "\n",
      "id: 80\n",
      "question: Give me a list of all critically endangered birds.\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P171>* <http://www.wikidata.org/entity/Q5113> . ?uri <http://www.wikidata.org/prop/direct/P141> <http://www.wikidata.org/entity/Q219127> . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q5113 .  ?sbj wdt:P1990 wd:Q219127 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'critically endangered birds')) . FILTER (lang(  ?sbj_label) = 'en')  } \n",
      "\n",
      "id: 159\n",
      "question: Which countries are connected by the Rhine?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri ?x ?y  WHERE { wd:Q584  wdt:P17 ?uri . ?uri wdt:P31 wd:Q6256 . } \n",
      "pred sparql: select distinct  ?answer where  {   ?answer wdt:P2789 wd:Q584 .  ?answer wdt:P31 wd:Q6256  }  \n",
      "\n",
      "id: 163\n",
      "question: Give me all chemical elements.\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q11344 . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q11344 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'chemical elements')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "\n",
      "id: 211\n",
      "question: Give me all American presidents of the last 20 years.\n",
      "ref sparql: PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX p: <http://www.wikidata.org/prop/> SELECT DISTINCT ?uri WHERE { ?uri p:P39 ?position . ?position ps:P39 wd:Q11696 . ?position pq:P582 ?termEnd. FILTER((YEAR(NOW()) - YEAR(?termEnd)) <= 20) }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q11696 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'all American presidents of the last 20 years')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "\n",
      "id: 51\n",
      "question: When is the movie Worst Case Scenario going to be in cinemas in the Netherlands?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?date WHERE { wd:Q6667101 wdt:P577 ?date }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q6667101 wdt:P1434  ?answer  }  \n",
      "\n",
      "id: 131\n",
      "question: What languages are spoken in Pakistan?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT * { wd:Q843 wdt:P2936 ?uri . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q843 wdt:P1412  ?answer  }  \n",
      "\n",
      "id: 164\n",
      "question: Who was on the Apollo 11 mission?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q43653> <http://www.wikidata.org/prop/direct/P1029> ?uri}\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q43653 wdt:P450  ?answer  }  \n",
      "\n",
      "id: 151\n",
      "question: Give me all B-sides of the Ramones.\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> SELECT ?res WHERE { ?res wdt:P175 wd:Q483407 . ?res p:P1433 _:a ._:a pq:P2868 wd:Q13432985 . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q483407 .  ?sbj wdt:P1432 wd:Q13432985 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'Ramones')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "\n",
      "id: 63\n",
      "question: Who was called Scarface?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri { ?uri wdt:P1449 ?nickname . FILTER REGEX(STR(?nickname), \"^Scarface$\") }\n",
      "pred sparql: select distinct  ?answer where  {  wd: Scarface wdt:P1449  ?answer  }  \n",
      "\n",
      "id: 27\n",
      "question: Which rivers flow into the North Sea?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q4022> . ?uri <http://www.wikidata.org/prop/direct/P403> <http://www.wikidata.org/entity/Q1693> . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q4022 wdt:P200  ?answer  }  \n",
      "\n",
      "id: 156\n",
      "question: Where is Fort Knox located?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri { wd:Q8962067 wdt:P131+ ?uri . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q8962067 wdt:P276  ?answer  }  \n",
      "\n",
      "id: 207\n",
      "question: Which daughters of British earls died at the same place they were born at?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri { ?uri wdt:P19 ?birthplace . ?uri wdt:P20 ?deathplace . FILTER(?birthplace = ?deathplace) ?uri wdt:P21 wd:Q6581072 . ?uri wdt:P22 ?father . ?father wdt:P97/wdt:P460 wd:Q1128240. ?father wdt:P27*/wdt:P1366*/wdt:P706* wd:Q38272 . }\n",
      "pred sparql: SELECT WHERE  {  wd:Q6581072 p:P20  ?s .  ?s ps:P20 wd:Q1128240 .  ?s pq:P19 wd:Q38272  }  \n",
      "\n",
      "id: 133\n",
      "question: What are the names of the Teenage Mutant Ninja Turtles?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P361> <http://www.wikidata.org/entity/Q1381762> . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q1381762 wdt:P2561  ?answer  }  \n",
      "\n",
      "id: 103\n",
      "question: Where does Piccadilly start?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q1124023> <http://www.wikidata.org/prop/direct/P559> ?uri}\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q1124023 wdt:P1427  ?X .  ?X wdt:P1427  ?answer  }  \n",
      "\n",
      "id: 165\n",
      "question: What is the name of the university where Obama's wife studied?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri ?institute WHERE { wd:Q76 wdt:P26/wdt:P69/wdt:P361* ?uri . ?uri wdt:P31*/wdt:P279* wd:Q3918 . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q76 wdt:P1075  ?answer  }  \n",
      "\n",
      "id: 108\n",
      "question: When did Paraguay proclaim its independence?\n",
      "ref sparql: SELECT ?o1 WHERE { <http://www.wikidata.org/entity/Q733>  <http://www.wikidata.org/prop/direct/P571>  ?o1 .  }\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q733 wdt:P1775  ?X .  ?X wdt:P793  ?answer  }  \n",
      "\n",
      "id: 15\n",
      "question: How short is the shortest active NBA player?\n",
      "ref sparql: SELECT DISTINCT ?height WHERE { ?uri <http://www.wikidata.org/prop/direct/P106>  <http://www.wikidata.org/entity/Q3665646> . ?uri <http://www.wikidata.org/prop/direct/P54>/<http://www.wikidata.org/prop/direct/P118> <http://www.wikidata.org/entity/Q155223> .  ?uri <http://www.wikidata.org/prop/P54> ?teamMembership . FILTER NOT EXISTS { ?teamMembership <http://www.wikidata.org/prop/qualifier/P582> ?endDate } ?uri  <http://www.wikidata.org/prop/direct/P2048> ?height } ORDER BY ?height LIMIT 1\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q3665646 wdt:P5109  ?answer  }  \n",
      "\n",
      "id: 82\n",
      "question: When was Jack Wolfskin founded?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT ?date WHERE { wd:Q536133 wdt:P571 ?date . } \n",
      "pred sparql: select distinct  ?answer where  {  wd:Q536133 wdt:P112  ?answer  }  \n",
      "\n",
      "id: 201\n",
      "question: What is the founding year of the brewery that produces Pilsner Urquell?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT ?date WHERE { wd:Q948831 wdt:P571 ?date . } \n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q948831 wdt:P571  ?X .  ?X wdt:P1056  ?answer  }  \n",
      "\n",
      "id: 171\n",
      "question: When did the Boston Tea Party take place?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q19024> <http://www.wikidata.org/prop/direct/P585> ?uri}\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q19024 wdt:P837  ?X .  ?X wdt:P837  ?answer  }  \n",
      "\n",
      "id: 182\n",
      "question: Which animals are critically endangered?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P141 wd:Q219127 }\n",
      "pred sparql: select distinct  ?answer where  {   ?answer wdt:P689 wd:Q219127  }  \n",
      "\n",
      "id: 13\n",
      "question: Which politicians were married to a German?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P106> <http://www.wikidata.org/entity/Q82955> . ?uri <http://www.wikidata.org/prop/direct/P26> ?spouse . { ?spouse <http://www.wikidata.org/prop/direct/P27> <http://www.wikidata.org/entity/Q183> . } UNION { ?spouse <http://www.wikidata.org/prop/direct/P19>/<http://www.wikidata.org/prop/direct/P17> <http://www.wikidata.org/entity/Q183> } } \n",
      "pred sparql: SELECT WHERE  {  wd:Q82955 p:P26  ?s .  ?s ps:P26 wd:Q183 .  ?s pq:P26 wd:Q183  }  \n",
      "\n",
      "id: 194\n",
      "question: Which U.S. state has the abbreviation MN?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q35657 . ?uri wdt:P1813 ?name . FILTER( REGEX( ?name, \"^MN$\")) } \n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q35657 wdt:P281  ?X .  ?X wdt:P1813  ?answer  }  \n",
      "\n",
      "id: 175\n",
      "question: When did Muhammad die?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?date WHERE { wd:Q9458 wdt:P570 ?date . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q9458 wdt:P570  ?answer  }  \n",
      "\n",
      "id: 110\n",
      "question: Which movies did Kurosawa direct?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT * WHERE { ?uri wdt:P57 wd:Q8006 . } \n",
      "pred sparql: SELECT WHERE  {  wd:Q8006 p:P57  ?s .  ?s ps:P57  ?obj  }  \n",
      "\n",
      "id: 206\n",
      "question: What was the name of the famous battle in 1836 in San Antonio?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P276 wd:Q975 . ?uri wdt:P31 wd:Q178561 . ?uri wdt:P585 ?time . FILTER( YEAR(?time) = 1836 ) } \n",
      "pred sparql: select distinct  ?answer where  {  wd:Q975 wdt:P1635  ?answer  }  \n",
      "\n",
      "id: 97\n",
      "question: Give me the official websites of actors of the television show Charmed.\n",
      "ref sparql: PREFIX p: <http://www.wikidata.org/prop/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q162371 p:P161/ps:P161/wdt:P856 ?uri . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q162371 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'Charmed')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "\n",
      "id: 169\n",
      "question: Give me all libraries established before 1400.\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT * WHERE { ?uri wdt:P31/wdt:P279* wd:Q7075 . ?uri wdt:P571 ?date . FILTER( YEAR(?date) < 1400 ) } \n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q7075 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), '1400')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "\n",
      "id: 38\n",
      "question: Give me all Frisian islands that belong to the Netherlands.\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { { wd:Q76936 wdt:P527+ ?uri . } UNION { wd:Q76936 wdt:P527* ?islandgroup . ?uri wdt:P361+ ?islandgroup . } ?uri wdt:P17 wd:Q55 . ?uri wdt:P31 wd:Q23442 . } \n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q76936 .  ?sbj wdt:P127 wd:Q55 .  ?sbj wdt:P127 wd:Q23442 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'the Netherlands')) . FILTER (lang(  ?s\n",
      "\n",
      "id: 192\n",
      "question: Which museum exhibits The Scream by Munch?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q471379> <http://www.wikidata.org/prop/direct/P527>/<http://www.wikidata.org/prop/direct/P276> ?uri . ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q207694>}\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q471379 wdt:P1436  ?answer  }  \n",
      "\n",
      "id: 19\n",
      "question: Who became president after JFK died?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q9696> <http://www.wikidata.org/prop/P39> ?position . ?position  <http://www.wikidata.org/prop/statement/P39> <http://www.wikidata.org/entity/Q11696> . ?position <http://www.wikidata.org/prop/qualifier/P1366> ?uri . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q9696 wdt:P35  ?answer  }  \n",
      "\n",
      "id: 174\n",
      "question: Who is the novelist of the work a song of ice and fire?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q45875 ?p ?uri . ?uri wdt:P106 wd:Q6625963 . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q45875 wdt:P1441  ?answer  }  \n",
      "\n",
      "id: 189\n",
      "question: In which studio did the Beatles record their first album?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?album wdt:P31 wd:Q482994 ; wdt:P175 wd:Q1299 ; wdt:P577 ?date ; wdt:P483 ?uri . } ORDER BY ?date LIMIT 1\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q482994 wdt:P483  ?X .  ?X wdt:P483 wd:Q1299  }  \n",
      "\n",
      "id: 152\n",
      "question: Which beer brewing companies are located in North-Rhine Westphalia?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q131734 . ?uri wdt:P159*/wdt:P31*/wdt:P131 wd:Q1198 . } \n",
      "pred sparql: SELECT WHERE  {  wd:Q131734 p:P355  ?s .  ?s ps:P355 wd:Q1198 .  ?s pq:P276  ?value  }  \n",
      "\n",
      "id: 94\n",
      "question: When did princess Diana die?\n",
      "ref sparql: SELECT DISTINCT ?date WHERE { <http://www.wikidata.org/entity/Q9685> <http://www.wikidata.org/prop/direct/P570> ?date  . }\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q9685 wdt:P570  ?X .  ?X wdt:P570  ?answer  }  \n",
      "\n",
      "id: 95\n",
      "question: Who is the youngest player in the Premier League?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?team wdt:P118 wd:Q9448 . ?uri wdt:P54 ?team ; wdt:P569 ?dateOfBirth . } ORDER BY DESC(?dateOfBirth) LIMIT 1\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q9448 wdt:P19  ?answer  }  \n",
      "\n",
      "id: 119\n",
      "question: Which instruments does Cat Stevens play?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q154216> <http://www.wikidata.org/prop/direct/P1303> ?uri . } \n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q154216 wdt:P1303  ?X .  ?X wdt:P1303  ?answer  }  \n",
      "\n",
      "id: 116\n",
      "question: Who was called Rodzilla?\n",
      "ref sparql: PREFIX skos: <http://www.w3.org/2004/02/skos/core#> SELECT * WHERE { ?uri skos:altLabel \"Rodzilla\"@en . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:select  ?answer wdt:P1449  ?answer  }  \n",
      "\n",
      "id: 138\n",
      "question: Give me the capitals of all countries in Africa.\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?country <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q6256> . ?country  <http://www.wikidata.org/prop/direct/P30> <http://www.wikidata.org/entity/Q15> . ?country <http://www.wikidata.org/prop/direct/P36> ?uri . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q6256 .  ?sbj wdt:P36 wd:Q15 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'all capitals of all countries in Africa')) . FILTER (lang(  ?sbj_label) = 'en')  } \n",
      "\n",
      "id: 177\n",
      "question: Which bridges are of the same type as the Manhattan Bridge?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri { wd:Q125050 wdt:P31 ?type . ?uri wdt:P31 ?type . ?uri wdt:P31/wdt:P279* wd:Q12280 . FILTER( ?type != wd:Q12280 ) }\n",
      "pred sparql: SELECT WHERE  {  wd:Q125050 p:P177  ?s .  ?s ps:P177 wd:Q12280 .  ?s pq:P179  ?value  }  \n",
      "\n",
      "id: 87\n",
      "question: Which book has the most pages?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q571 . ?uri wdt:P1104 ?number . } ORDER BY DESC(?number) LIMIT 1\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q571 wdt:P1104  ?X .  ?X wdt:P1104  ?answer  }  \n",
      "\n",
      "id: 148\n",
      "question: What is the largest state in the United States?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q35657 . ?uri wdt:P2046 ?area . } ORDER BY DESC(?area) LIMIT 1\n",
      "pred sparql: select distinct  ?answer where  {   ?answer wdt:P150 wd:Q35657  }  \n",
      "\n",
      "id: 43\n",
      "question: Give me the websites of companies with more than 500000 employees.\n",
      "ref sparql: SELECT DISTINCT ?string WHERE { ?uri <http://www.wikidata.org/prop/direct/P31>/(<http://www.wikidata.org/prop/direct/P279>*) <http://www.wikidata.org/entity/Q4830453> . ?uri <http://www.wikidata.org/prop/direct/P1128> ?number . FILTER(?number > 500000) . ?uri <http://www.wikidata.org/prop/direct/P856> ?string . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q4830453 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), '500000')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "\n",
      "id: 179\n",
      "question: What were the names of the three ships by Columbus?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q11446 . ?uri wdt:P1344/wdt:P710 wd:Q7322 . } \n",
      "pred sparql: select distinct  ?answer where  {  wd:Q11446 wdt:P734  ?answer  }  \n",
      "\n",
      "94 SPARQL queries don't give an answer\n"
     ]
    }
   ],
   "source": [
    "# check reason of no answer\n",
    "counter = 0\n",
    "\n",
    "for ref, pred in zip(ref_ques_list, pred_ques_list):\n",
    "    ques_pair = Ques_pair(ref, pred)\n",
    "    if ques_pair.pred_answer==[]:\n",
    "        ques_pair.print()\n",
    "        counter += 1\n",
    "\n",
    "print(str(counter) + \" SPARQL queries don't give an answer\")\n",
    "\n",
    "# counter = sum([ques_pair.print() or 1 for ref, pred in zip(ref_ques_list, pred_ques_list) if (ques_pair := Ques_pair(ref, pred)).pred_answer == []])\n",
    "# print(counter)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "id: 81\n",
      "question: Butch Otter is the governor of which U.S. state?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT ?res WHERE { ?res wdt:P6 wd:Q39593 . }\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q39593 wdt:P35  ?X .  ?X wdt:P35  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 4\n",
      "question: Which airports are located in California, USA?\n",
      "ref sparql: SELECT DISTINCT ?s1 WHERE { ?s1  ?p1  <http://www.wikidata.org/entity/Q1248784> . ?s1  <http://www.wikidata.org/prop/direct/P276>  <http://www.wikidata.org/entity/Q99> .  }\n",
      "pred sparql: select distinct  ?answer where  {   ?answer wdt:P931 wd:Q1248784 .  ?answer wdt:P31 wd:Q99  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 214\n",
      "question: Give me all professional skateboarders from Sweden.\n",
      "ref sparql:  SELECT ?s1 WHERE { ?s1  <http://www.wikidata.org/prop/direct/P641> <http://www.wikidata.org/entity/Q842284> . ?s1  <http://www.wikidata.org/prop/direct/P19> ?o1 . ?o1 <http://www.wikidata.org/prop/direct/P131>* <http://www.wikidata.org/entity/Q34> . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q842284 .  ?sbj wdt:P425 wd:Q34 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'all professional skateboarders from Sweden')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT\n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 210\n",
      "question: Which monarchs of the United Kingdom were married to a German?\n",
      "ref sparql: PREFIX p: <http://www.wikidata.org/prop/> PREFIX ps: <https://w3id.org/payswarm#> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX bd: <http://www.bigdata.com/rdf#> PREFIX wikibase: <http://wikiba.se/ontology#> SELECT DISTINCT ?uri WHERE { { ?uri ?allowed wd:Q9134365 . VALUES ?allowed { wdt:P39 wdt:P97 } } UNION { ?uri wdt:P39 ?position . VALUES ?position { wd:Q116 wd:Q12097  } ?uri p:P39/pq:P642 ?kingdom . } VALUES ?kingdom { wd:Q161885 wd:Q174193 } . ?uri wdt:P26 ?spouse . ?spouse wdt:P19/wdt:P17 wd:Q183 . }\n",
      "pred sparql: SELECT WHERE  {  wd:Q9134365 p:P26  ?s .  ?s ps:P26 wd:Q116 .  ?s pq:P26 wd:Q183  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 199\n",
      "question: Give me all Argentine films.\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri { ?uri wdt:P31 wd:Q11424 . ?uri wdt:P495 wd:Q414 }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q11424 .  ?sbj wdt:P155 wd:Q414 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'all Argentine films')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 197\n",
      "question: Which U.S. state has been admitted latest?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P31 wd:Q35657 . ?uri wdt:P571 ?date } ORDER BY DESC(?date) LIMIT 1\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q35657 wdt:P971  ?X .  ?X wdt:P1365  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 196\n",
      "question: Which classes does the Millepede belong to?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q11185669 wdt:P279 ?uri . }\n",
      "pred sparql: SELECT WHERE  {  wd:Q11185669 p:P361  ?s .  ?s ps:P361  ?obj  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 188\n",
      "question: Give me the homepage of Forbes.\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q25161472 wdt:P856 ?uri } \n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q25161472 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'homepage')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 62\n",
      "question: What is the highest place of Karakoram?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q5469 wdt:P610 ?uri }\n",
      "pred sparql: select distinct  ?answer where  {   ?answer wdt:P610 wd:Q5469  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 166\n",
      "question: Which computer scientist won an oscar?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P106> <http://www.wikidata.org/entity/Q82594> . ?uri <http://www.wikidata.org/prop/direct/P166> ?award . ?award <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q19020> . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q82594 wdt:P166  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 158\n",
      "question: Give me all writers that won the Nobel Prize in literature.\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q36180 ; wdt:P166 wd:Q37922 . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q36180 .  ?sbj wdt:P1346 wd:Q37922 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'nobelprize in literature')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 157\n",
      "question: Give me English actors starring in Lovesick.\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q12125895 wdt:P161 ?uri. ?uri wdt:P19 ?birthplace . ?birthplace wdt:P17 wd:Q145 . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q12125895 .  ?sbj wdt:P161 wd:Q145 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'Lovesick')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 150\n",
      "question: In which city was the president of Montenegro born?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q236> <http://www.wikidata.org/prop/direct/P35>/<http://www.wikidata.org/prop/direct/P19> ?uri . ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q515> . }\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q236 wdt:P19  ?X .  ?X wdt:P19 wd:Q515  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 149\n",
      "question: Which U.S. state has the highest population density?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT ?uri { ?uri wdt:P31 wd:Q35657 . ?uri wdt:P1082 ?population . ?uri wdt:P2046 ?area . BIND((?population/?area) AS ?density ) } ORDER BY DESC(?density) LIMIT 1\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q35657 wdt:P150  ?X .  ?X wdt:P1082  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 25\n",
      "question: What is the longest river in China?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q4022> . ?uri <http://www.wikidata.org/prop/direct/P17> <http://www.wikidata.org/entity/Q148> . ?uri <http://www.wikidata.org/prop/direct/P2043> ?length } ORDER BY DESC(?length) LIMIT 1\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q4022 wdt:P2918  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 143\n",
      "question: What is the area code of Berlin?\n",
      "ref sparql: SELECT DISTINCT ?string WHERE { <http://www.wikidata.org/entity/Q64> <http://www.wikidata.org/prop/direct/P473> ?string . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q64 wdt:P1894  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 132\n",
      "question: What is Elon Musk famous for?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q317521> <http://www.wikidata.org/prop/direct/P61> ?uri . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q317521 wdt:P800  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 124\n",
      "question: When was Carlo Giuliani shot?\n",
      "ref sparql:  SELECT ?o1 WHERE { <http://www.wikidata.org/entity/Q164791>  <http://www.wikidata.org/prop/direct/P570>  ?o1 .  }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q164791 wdt:P20  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 117\n",
      "question: Is Pamela Anderson a vegan?\n",
      "ref sparql: ASK where { <http://www.wikidata.org/entity/Q83325> <http://www.wikidata.org/prop/direct/P1576> <http://www.wikidata.org/entity/Q83364>}\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q83325 wdt:P676  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 59\n",
      "question: Which space probes were sent into orbit around the sun?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P522> <http://www.wikidata.org/entity/Q737809> . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q737809 wdt:P2375  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 113\n",
      "question: Which German cities have more than 250000 inhabitants?\n",
      "ref sparql:  SELECT ?s1 WHERE { ?s1  <http://www.wikidata.org/prop/direct/P17>  <http://www.wikidata.org/entity/Q183> .  ?s1 <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q515> .  ?s1  <http://www.wikidata.org/prop/direct/P1082>  ?o1 . FILTER ( ?o1 > \"250000\"^^<http://www.w3.org/2001/XMLSchema#integer>)}\n",
      "pred sparql: SELECT WHERE  {  wd:Q183 p:P1082  ?s .  ?s ps:P1082 wd:Q515 .  ?s pq:P1082  ?value  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 104\n",
      "question: Who is the daughter of Robert Kennedy married to?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q25310> <http://www.wikidata.org/prop/direct/P40> ?daughter . ?daughter  <http://www.wikidata.org/prop/direct/P21> <http://www.wikidata.org/entity/Q6581072> . ?daughter  <http://www.wikidata.org/prop/direct/P26> ?uri .}\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q25310 wdt:P26  ?X .  ?X wdt:P40 wd:Q6581072  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 129\n",
      "question: Who does the voice of Bart Simpson?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q5480> <http://www.wikidata.org/prop/direct/P725> ?uri }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q5480 wdt:P725  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 183\n",
      "question: Who was Tom Hanks married to?\n",
      "ref sparql: SELECT ?o1 WHERE { <http://www.wikidata.org/entity/Q2263>  <http://www.wikidata.org/prop/direct/P26>  ?o1 .  }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q2263 wdt:P26  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 7\n",
      "question: Give me all cars that are produced in Germany.\n",
      "ref sparql: SELECT DISTINCT * WHERE { ?s1 <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q59773381> .  ?s1 <http://www.wikidata.org/prop/direct/P176> ?o1 . ?o1  <http://www.wikidata.org/prop/direct/P17>  <http://www.wikidata.org/entity/Q183> . ?o1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q786820> . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q59773381 .  ?sbj wdt:P1056 wd:Q183 .  ?sbj wdt:P1056 wd:Q786820 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'german')) . FILTER (lang(  ?s\n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 135\n",
      "question: When did Michael Jackson die?\n",
      "ref sparql:  SELECT ?o1 WHERE { <http://www.wikidata.org/entity/Q2831>  <http://www.wikidata.org/prop/direct/P570>  ?o1 .  } \n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q2831 wdt:P509  ?X .  ?X wdt:P570  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 39\n",
      "question: Which poet wrote the most books?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q49757 . ?x wdt:P50 ?uri ; wdt:P31 wd:Q571 . } GROUP BY ?uri ORDER BY DESC(COUNT(?x)) LIMIT 1\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q49757 wdt:P50  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 71\n",
      "question: Give me all spacecrafts that flew to Mars.\n",
      "ref sparql: SELECT ?s1 where  { ?s1 <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q389459> } \n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q389459 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'flew to Mars')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 213\n",
      "question: Show me all Czech movies.\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q11424> . { ?uri <http://www.wikidata.org/prop/direct/P495> <http://www.wikidata.org/entity/Q213> . } UNION { ?uri <http://www.wikidata.org/prop/direct/P495> <http://www.wikidata.org/entity/Q33946> . } }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q11424 .  ?sbj wdt:P1431 wd:Q213 .  ?sbj wdt:P31 wd:Q33946 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'Czech movies')) . FILTER (lang(  ?s\n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 105\n",
      "question: Which countries have more than ten volcanoes?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE {  { ?volcano <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q8072> . } UNION { ?volcano <http://www.wikidata.org/prop/direct/P31> ?type . ?type <http://www.wikidata.org/prop/direct/P279>* <http://www.wikidata.org/entity/Q8072> . } ?volcano <http://www.wikidata.org/prop/direct/P17> ?uri . } GROUP BY ?uri HAVING(COUNT(?volcano)>10)\n",
      "pred sparql: SELECT WHERE  {  wd:Q8072 p:P150  ?s .  ?s ps:P150 wd:Q8072 .  ?s pq:P995  ?value  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 52\n",
      "question: Give me all movies with Tom Cruise.\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P161 wd:Q37079. }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q37079 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'Tom Cruise')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 34\n",
      "question: Give me all female German chancellors.\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P21 wd:Q6581072 . ?uri wdt:P39 wd:Q4970706 . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q6581072 .  ?sbj wdt:P21 wd:Q4970706 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'all female German chancellors')) . FILTER (lang(  ?sbj_label) = 'en')  } \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 145\n",
      "question: Who owns Aldi?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q125054 wdt:P355 ?uri }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q125054 wdt:P1830  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 154\n",
      "question: Which books were written by Danielle Steel?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P50 wd:Q72653 . ?uri wdt:P136 ?genre . ?genre wdt:P279* wd:Q571 . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q72653 wdt:P50  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 198\n",
      "question: Who was influenced by Socrates?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT * WHERE { ?uri wdt:P31 wd:Q5 . ?uri wdt:P737 wd:Q913 . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q5 wdt:P737  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 162\n",
      "question: How deep is Lake Chiemsee?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?n WHERE { wd:Q4138  wdt:P4511 ?n }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q4138 wdt:P1589  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 96\n",
      "question: Which professional surfers were born on the Philippines?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT * WHERE { ?uri wdt:P19 ?birtplace . ?birtplace wdt:P17 wd:Q928 . ?uri wdt:P106  wd:Q13561328 . }\n",
      "pred sparql: SELECT WHERE  {  wd:Q928 p:P19  ?s .  ?s ps:P19 wd:Q13561328 .  ?s pq:P31  ?value  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 79\n",
      "question: Are there any castles in the United States?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> ASK WHERE { { ?uri wdt:P31 wd:Q23413. } UNION { ?uri wdt:P31 ?castlesubtype . ?castlesubtype wdt:P279* wd:Q23413 } ?uri wdt:P17 wd:Q30 }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q23413 wdt:PCastles wdt:P31 wd:Q30  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 141\n",
      "question: Which languages are spoken in Estonia?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT * WHERE { wd:Q191 wdt:P2936 ?lang . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q191 wdt:P1412  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 80\n",
      "question: Give me a list of all critically endangered birds.\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P171>* <http://www.wikidata.org/entity/Q5113> . ?uri <http://www.wikidata.org/prop/direct/P141> <http://www.wikidata.org/entity/Q219127> . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q5113 .  ?sbj wdt:P1990 wd:Q219127 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'critically endangered birds')) . FILTER (lang(  ?sbj_label) = 'en')  } \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 159\n",
      "question: Which countries are connected by the Rhine?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri ?x ?y  WHERE { wd:Q584  wdt:P17 ?uri . ?uri wdt:P31 wd:Q6256 . } \n",
      "pred sparql: select distinct  ?answer where  {   ?answer wdt:P2789 wd:Q584 .  ?answer wdt:P31 wd:Q6256  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 163\n",
      "question: Give me all chemical elements.\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q11344 . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q11344 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'chemical elements')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 211\n",
      "question: Give me all American presidents of the last 20 years.\n",
      "ref sparql: PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX p: <http://www.wikidata.org/prop/> SELECT DISTINCT ?uri WHERE { ?uri p:P39 ?position . ?position ps:P39 wd:Q11696 . ?position pq:P582 ?termEnd. FILTER((YEAR(NOW()) - YEAR(?termEnd)) <= 20) }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q11696 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'all American presidents of the last 20 years')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 51\n",
      "question: When is the movie Worst Case Scenario going to be in cinemas in the Netherlands?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?date WHERE { wd:Q6667101 wdt:P577 ?date }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q6667101 wdt:P1434  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 131\n",
      "question: What languages are spoken in Pakistan?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT * { wd:Q843 wdt:P2936 ?uri . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q843 wdt:P1412  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 164\n",
      "question: Who was on the Apollo 11 mission?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q43653> <http://www.wikidata.org/prop/direct/P1029> ?uri}\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q43653 wdt:P450  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 151\n",
      "question: Give me all B-sides of the Ramones.\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> SELECT ?res WHERE { ?res wdt:P175 wd:Q483407 . ?res p:P1433 _:a ._:a pq:P2868 wd:Q13432985 . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q483407 .  ?sbj wdt:P1432 wd:Q13432985 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'Ramones')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 63\n",
      "question: Who was called Scarface?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri { ?uri wdt:P1449 ?nickname . FILTER REGEX(STR(?nickname), \"^Scarface$\") }\n",
      "pred sparql: select distinct  ?answer where  {  wd: Scarface wdt:P1449  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 27\n",
      "question: Which rivers flow into the North Sea?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q4022> . ?uri <http://www.wikidata.org/prop/direct/P403> <http://www.wikidata.org/entity/Q1693> . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q4022 wdt:P200  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 156\n",
      "question: Where is Fort Knox located?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri { wd:Q8962067 wdt:P131+ ?uri . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q8962067 wdt:P276  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 207\n",
      "question: Which daughters of British earls died at the same place they were born at?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri { ?uri wdt:P19 ?birthplace . ?uri wdt:P20 ?deathplace . FILTER(?birthplace = ?deathplace) ?uri wdt:P21 wd:Q6581072 . ?uri wdt:P22 ?father . ?father wdt:P97/wdt:P460 wd:Q1128240. ?father wdt:P27*/wdt:P1366*/wdt:P706* wd:Q38272 . }\n",
      "pred sparql: SELECT WHERE  {  wd:Q6581072 p:P20  ?s .  ?s ps:P20 wd:Q1128240 .  ?s pq:P19 wd:Q38272  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 13\n",
      "question: Which politicians were married to a German?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P106> <http://www.wikidata.org/entity/Q82955> . ?uri <http://www.wikidata.org/prop/direct/P26> ?spouse . { ?spouse <http://www.wikidata.org/prop/direct/P27> <http://www.wikidata.org/entity/Q183> . } UNION { ?spouse <http://www.wikidata.org/prop/direct/P19>/<http://www.wikidata.org/prop/direct/P17> <http://www.wikidata.org/entity/Q183> } } \n",
      "pred sparql: SELECT WHERE  {  wd:Q82955 p:P26  ?s .  ?s ps:P26 wd:Q183 .  ?s pq:P26 wd:Q183  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 194\n",
      "question: Which U.S. state has the abbreviation MN?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q35657 . ?uri wdt:P1813 ?name . FILTER( REGEX( ?name, \"^MN$\")) } \n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q35657 wdt:P281  ?X .  ?X wdt:P1813  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 110\n",
      "question: Which movies did Kurosawa direct?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT * WHERE { ?uri wdt:P57 wd:Q8006 . } \n",
      "pred sparql: SELECT WHERE  {  wd:Q8006 p:P57  ?s .  ?s ps:P57  ?obj  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 206\n",
      "question: What was the name of the famous battle in 1836 in San Antonio?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P276 wd:Q975 . ?uri wdt:P31 wd:Q178561 . ?uri wdt:P585 ?time . FILTER( YEAR(?time) = 1836 ) } \n",
      "pred sparql: select distinct  ?answer where  {  wd:Q975 wdt:P1635  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 97\n",
      "question: Give me the official websites of actors of the television show Charmed.\n",
      "ref sparql: PREFIX p: <http://www.wikidata.org/prop/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q162371 p:P161/ps:P161/wdt:P856 ?uri . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q162371 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'Charmed')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 169\n",
      "question: Give me all libraries established before 1400.\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT * WHERE { ?uri wdt:P31/wdt:P279* wd:Q7075 . ?uri wdt:P571 ?date . FILTER( YEAR(?date) < 1400 ) } \n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q7075 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), '1400')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 38\n",
      "question: Give me all Frisian islands that belong to the Netherlands.\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { { wd:Q76936 wdt:P527+ ?uri . } UNION { wd:Q76936 wdt:P527* ?islandgroup . ?uri wdt:P361+ ?islandgroup . } ?uri wdt:P17 wd:Q55 . ?uri wdt:P31 wd:Q23442 . } \n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q76936 .  ?sbj wdt:P127 wd:Q55 .  ?sbj wdt:P127 wd:Q23442 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'the Netherlands')) . FILTER (lang(  ?s\n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 192\n",
      "question: Which museum exhibits The Scream by Munch?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q471379> <http://www.wikidata.org/prop/direct/P527>/<http://www.wikidata.org/prop/direct/P276> ?uri . ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q207694>}\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q471379 wdt:P1436  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 19\n",
      "question: Who became president after JFK died?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q9696> <http://www.wikidata.org/prop/P39> ?position . ?position  <http://www.wikidata.org/prop/statement/P39> <http://www.wikidata.org/entity/Q11696> . ?position <http://www.wikidata.org/prop/qualifier/P1366> ?uri . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q9696 wdt:P35  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 174\n",
      "question: Who is the novelist of the work a song of ice and fire?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q45875 ?p ?uri . ?uri wdt:P106 wd:Q6625963 . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q45875 wdt:P1441  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 189\n",
      "question: In which studio did the Beatles record their first album?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?album wdt:P31 wd:Q482994 ; wdt:P175 wd:Q1299 ; wdt:P577 ?date ; wdt:P483 ?uri . } ORDER BY ?date LIMIT 1\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q482994 wdt:P483  ?X .  ?X wdt:P483 wd:Q1299  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 152\n",
      "question: Which beer brewing companies are located in North-Rhine Westphalia?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q131734 . ?uri wdt:P159*/wdt:P31*/wdt:P131 wd:Q1198 . } \n",
      "pred sparql: SELECT WHERE  {  wd:Q131734 p:P355  ?s .  ?s ps:P355 wd:Q1198 .  ?s pq:P276  ?value  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 94\n",
      "question: When did princess Diana die?\n",
      "ref sparql: SELECT DISTINCT ?date WHERE { <http://www.wikidata.org/entity/Q9685> <http://www.wikidata.org/prop/direct/P570> ?date  . }\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q9685 wdt:P570  ?X .  ?X wdt:P570  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 95\n",
      "question: Who is the youngest player in the Premier League?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?team wdt:P118 wd:Q9448 . ?uri wdt:P54 ?team ; wdt:P569 ?dateOfBirth . } ORDER BY DESC(?dateOfBirth) LIMIT 1\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q9448 wdt:P19  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 119\n",
      "question: Which instruments does Cat Stevens play?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q154216> <http://www.wikidata.org/prop/direct/P1303> ?uri . } \n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q154216 wdt:P1303  ?X .  ?X wdt:P1303  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 116\n",
      "question: Who was called Rodzilla?\n",
      "ref sparql: PREFIX skos: <http://www.w3.org/2004/02/skos/core#> SELECT * WHERE { ?uri skos:altLabel \"Rodzilla\"@en . }\n",
      "pred sparql: select distinct  ?answer where  {  wd:select  ?answer wdt:P1449  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 138\n",
      "question: Give me the capitals of all countries in Africa.\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?country <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q6256> . ?country  <http://www.wikidata.org/prop/direct/P30> <http://www.wikidata.org/entity/Q15> . ?country <http://www.wikidata.org/prop/direct/P36> ?uri . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q6256 .  ?sbj wdt:P36 wd:Q15 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), 'all capitals of all countries in Africa')) . FILTER (lang(  ?sbj_label) = 'en')  } \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 177\n",
      "question: Which bridges are of the same type as the Manhattan Bridge?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri { wd:Q125050 wdt:P31 ?type . ?uri wdt:P31 ?type . ?uri wdt:P31/wdt:P279* wd:Q12280 . FILTER( ?type != wd:Q12280 ) }\n",
      "pred sparql: SELECT WHERE  {  wd:Q125050 p:P177  ?s .  ?s ps:P177 wd:Q12280 .  ?s pq:P179  ?value  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 87\n",
      "question: Which book has the most pages?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q571 . ?uri wdt:P1104 ?number . } ORDER BY DESC(?number) LIMIT 1\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q571 wdt:P1104  ?X .  ?X wdt:P1104  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 148\n",
      "question: What is the largest state in the United States?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q35657 . ?uri wdt:P2046 ?area . } ORDER BY DESC(?area) LIMIT 1\n",
      "pred sparql: select distinct  ?answer where  {   ?answer wdt:P150 wd:Q35657  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 43\n",
      "question: Give me the websites of companies with more than 500000 employees.\n",
      "ref sparql: SELECT DISTINCT ?string WHERE { ?uri <http://www.wikidata.org/prop/direct/P31>/(<http://www.wikidata.org/prop/direct/P279>*) <http://www.wikidata.org/entity/Q4830453> . ?uri <http://www.wikidata.org/prop/direct/P1128> ?number . FILTER(?number > 500000) . ?uri <http://www.wikidata.org/prop/direct/P856> ?string . }\n",
      "pred sparql: SELECT DISTINCT  ?sbj  ?sbj_label WHERE  {   ?sbj wdt:P31 wd:Q4830453 .  ?sbj rdfs:label  ?sbj_label . FILTER(STRSTARTS(lcase(  ?sbj_label), '500000')) . FILTER (lang(  ?sbj_label) = 'en')  }  LIMIT 25 \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 179\n",
      "question: What were the names of the three ships by Columbus?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q11446 . ?uri wdt:P1344/wdt:P710 wd:Q7322 . } \n",
      "pred sparql: select distinct  ?answer where  {  wd:Q11446 wdt:P734  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "73 questions are 100% correct\n"
     ]
    }
   ],
   "source": [
    "# check correct answers\n",
    "counter = 0\n",
    "\n",
    "for ref, pred in zip(ref_ques_list, pred_ques_list):\n",
    "    ques_pair = Ques_pair(ref, pred)\n",
    "    if ques_pair.pred_answer==ques_pair.ref_answer:\n",
    "        ques_pair.print(print_answer=True)\n",
    "        counter += 1\n",
    "\n",
    "print(str(counter) + \" questions are 100% correct\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "id: 117\n",
      "question: Is Pamela Anderson a vegan?\n",
      "ref sparql: ASK where { <http://www.wikidata.org/entity/Q83325> <http://www.wikidata.org/prop/direct/P1576> <http://www.wikidata.org/entity/Q83364>}\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q83325 wdt:P676  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 79\n",
      "question: Are there any castles in the United States?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> ASK WHERE { { ?uri wdt:P31 wd:Q23413. } UNION { ?uri wdt:P31 ?castlesubtype . ?castlesubtype wdt:P279* wd:Q23413 } ?uri wdt:P17 wd:Q30 }\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q23413 wdt:PCastles wdt:P31 wd:Q30  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 92\n",
      "question: Is the wife of President Obama called Michelle?\n",
      "ref sparql: PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q76 wdt:P26 ?obj . ?obj rdfs:label ?label FILTER( REGEX( ?label, \"Michelle\" ) ) }\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q76 wdt:P26  ?X .  ?X wdt:P735  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q15621047'}}]\n",
      "\n",
      "0 of 3 predicted queries contain \"ASK\"\n"
     ]
    }
   ],
   "source": [
    "# check ASK queries\n",
    "count_all = 0\n",
    "count_ask = 0\n",
    "\n",
    "for ref, pred in zip(ref_ques_list, pred_ques_list):\n",
    "    ques_pair = Ques_pair(ref, pred)\n",
    "    if ques_pair.type == Type.BOOLEAN:\n",
    "        ques_pair.print(print_answer=True)\n",
    "        count_all += 1\n",
    "        if \"ASK\" in ques_pair.pred_sparql:\n",
    "            count_ask += 1\n",
    "\n",
    "print(f'''{count_ask} of {count_all} predicted queries contain \"ASK\"''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "id: 42\n",
      "question: Which countries have places with more than two caves?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?cave wdt:P31 wd:Q35509 ; wdt:P17 ?uri . } GROUP BY ?uri HAVING (COUNT(?cave) > 2)\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q35509 wdt:P276  ?X .  ?X wdt:P150  ?answer  }  \n",
      "ref_answer:\n",
      " [{'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q230'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q228'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q232'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q233'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q236'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q242'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q241'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q252'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q34020'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q36678'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q46395'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q219060'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q31354462'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q258'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q262'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q265'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q298'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q399'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q403'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q408'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q419'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q423'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q574'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q664'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q668'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q683'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q685'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q691'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q711'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q712'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q717'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q754'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q766'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q774'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q786'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q794'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q796'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q801'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q810'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q813'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q819'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q822'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q833'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q836'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q837'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q842'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q843'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q851'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q854'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q858'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q865'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q869'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q874'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q881'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q884'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q889'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q928'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q948'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q954'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q974'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q1019'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q1016'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q1030'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q1028'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q1033'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q1246'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q4628'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q23334'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q25230'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q16'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q17'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q20'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q27'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q30'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q31'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q28'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q29'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q34'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q32'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q33'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q38'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q39'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q36'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q43'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q40'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q41'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q45'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q55'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q79'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q77'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q96'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q142'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q145'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q148'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q155'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q159'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q183'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q191'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q189'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q211'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q214'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q215'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q212'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q213'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q218'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q219'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q222'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q221'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q227'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q224'}}, {'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q225'}}]\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 22\n",
      "question: How many grand-children did Jacques Cousteau have?\n",
      "ref sparql: SELECT (COUNT(DISTINCT ?uri) as ?count) WHERE { <http://www.wikidata.org/entity/Q83233> <http://www.wikidata.org/prop/direct/P40>/<http://www.wikidata.org/prop/direct/P40> ?uri }\n",
      "pred sparql: SELECT (COUNT(  ?obj) AS  ?value )  {  wd:Q83233 wdt:P1038  ?obj  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'value': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer', 'type': 'literal', 'value': '0'}}]\n",
      "\n",
      "id: 140\n",
      "question: How many scientists graduated from an Ivy League university?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri wdt:P106 wd:Q901 . ?uri wdt:P69 ?university. wd:Q49113  wdt:P527 ?university . }\n",
      "pred sparql: SELECT (COUNT(  ?obj) AS  ?value )  {  wd:Q901 wdt:P69  ?obj .  ?obj wdt:P69 wd:Q49113  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'value': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer', 'type': 'literal', 'value': '0'}}]\n",
      "\n",
      "id: 139\n",
      "question: Which professional surfers were born in Australia?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri wdt:P19 ?birtplace . ?birtplace wdt:P17 wd:Q408 . ?uri wdt:P106 wd:Q13561328 . }\n",
      "pred sparql: SELECT (COUNT(  ?obj) AS  ?value )  {  wd:Q408 wdt:P19  ?obj .  ?obj wdt:P19 wd:Q13561328  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'value': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer', 'type': 'literal', 'value': '0'}}]\n",
      "\n",
      "id: 111\n",
      "question: How many awards has Bertrand Russell?\n",
      "ref sparql:  SELECT  (COUNT(DISTINCT ?o1) as ?count)  WHERE { <http://www.wikidata.org/entity/Q33760>  <http://www.wikidata.org/prop/direct/P166>  ?o1 . } \n",
      "pred sparql: SELECT (COUNT(  ?obj) AS  ?value )  {  wd:Q33760 wdt:P166  ?obj  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'value': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer', 'type': 'literal', 'value': '7'}}]\n",
      "\n",
      "id: 178\n",
      "question: How many James Bond movies do exist?\n",
      "ref sparql:  SELECT (COUNT(?s1) as ?c) WHERE { ?s1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q11424> . ?s1  ?p  <http://www.wikidata.org/entity/Q2009573> .  FILTER (?p = <http://www.wikidata.org/prop/direct/P144> || ?p = <http://www.wikidata.org/prop/direct/P674>) }\n",
      "pred sparql: SELECT (COUNT(  ?obj) AS  ?value )  {  wd:Q11424 wdt:P1080  ?obj .  ?obj wdt:P1080 wd:Q2009573  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'value': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer', 'type': 'literal', 'value': '0'}}]\n",
      "\n",
      "id: 105\n",
      "question: Which countries have more than ten volcanoes?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE {  { ?volcano <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q8072> . } UNION { ?volcano <http://www.wikidata.org/prop/direct/P31> ?type . ?type <http://www.wikidata.org/prop/direct/P279>* <http://www.wikidata.org/entity/Q8072> . } ?volcano <http://www.wikidata.org/prop/direct/P17> ?uri . } GROUP BY ?uri HAVING(COUNT(?volcano)>10)\n",
      "pred sparql: SELECT WHERE  {  wd:Q8072 p:P150  ?s .  ?s ps:P150 wd:Q8072 .  ?s pq:P995  ?value  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 24\n",
      "question: How many emperors did China have?\n",
      "ref sparql: SELECT (COUNT(DISTINCT ?uri) as ?count) WHERE {  ?uri <http://www.wikidata.org/prop/direct/P39> <http://www.wikidata.org/entity/Q268218>}\n",
      "pred sparql: SELECT (COUNT(  ?obj) AS  ?value )  {  wd:Q268218 wdt:P35  ?obj  }  \n",
      "ref_answer:\n",
      " [{'count': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer', 'type': 'literal', 'value': '359'}}]\n",
      "pred_answer:\n",
      " [{'value': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer', 'type': 'literal', 'value': '0'}}]\n",
      "\n",
      "id: 115\n",
      "question: How many rivers and lakes are in South Carolina?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(?uri) AS ?c) WHERE { ?uri wdt:P131 wd:Q1456 . ?uri wdt:P31/wdt:P279* wd:Q23397 . }\n",
      "pred sparql: SELECT (COUNT(  ?obj) AS  ?value )  {  wd:Q1456 wdt:P200  ?obj .  ?obj wdt:P206 wd:Q23397  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'value': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer', 'type': 'literal', 'value': '0'}}]\n",
      "\n",
      "id: 101\n",
      "question: How many companies were founded by the founder of Facebook?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT( DISTINCT ?uri ) AS ?c ) WHERE { ?uri wdt:P112 wd:Q36215 . ?uri wdt:P31/wdt:P279* wd:Q783794 . } \n",
      "pred sparql: SELECT (COUNT(  ?obj) AS  ?value )  {  wd:Q36215 wdt:P112  ?obj .  ?obj wdt:P112 wd:Q783794  }  \n",
      "ref_answer:\n",
      " [{'c': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer', 'type': 'literal', 'value': '2'}}]\n",
      "pred_answer:\n",
      " [{'value': {'datatype': 'http://www.w3.org/2001/XMLSchema#integer', 'type': 'literal', 'value': '0'}}]\n",
      "\n",
      "8 of 10 predicted queries contain \"COUNT\"\n"
     ]
    }
   ],
   "source": [
    "# check COUNT queries\n",
    "count_all = 0\n",
    "count_count = 0\n",
    "\n",
    "for ref, pred in zip(ref_ques_list, pred_ques_list):\n",
    "    ques_pair = Ques_pair(ref, pred)\n",
    "    if ques_pair.type == Type.COUNT:\n",
    "        ques_pair.print(print_answer=True)\n",
    "        count_all += 1\n",
    "        if \"COUNT\" in ques_pair.pred_sparql:\n",
    "            count_count += 1\n",
    "\n",
    "print(f'''{count_count} of {count_all} predicted queries contain \"COUNT\"''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "id: 86\n",
      "question: What is the highest mountain in Germany?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P31 wd:Q8502 ; wdt:P2044 ?elevation ; wdt:P17 wd:Q183 . } ORDER BY DESC(?elevation) LIMIT 1\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q8502 wdt:P610  ?answer  }  \n",
      "ref_answer:\n",
      " [{'uri': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q3375'}}]\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 49\n",
      "question: Which frequent flyer program has the most airlines?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX ps: <http://www.wikidata.org/prop/statement/> SELECT ?frequentflyer WHERE { ?airlines wdt:P31 wd:Q46970 . ?airlines p:P4446/ps:P4446 ?frequentflyer . }  GROUP BY ?frequentflyer ORDER BY DESC(COUNT(?airlines)) LIMIT 1\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q46970 wdt:P5390  ?X .  ?X wdt:P113  ?answer  }  \n",
      "ref_answer:\n",
      " [{'frequentflyer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q642970'}}]\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 197\n",
      "question: Which U.S. state has been admitted latest?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P31 wd:Q35657 . ?uri wdt:P571 ?date } ORDER BY DESC(?date) LIMIT 1\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q35657 wdt:P971  ?X .  ?X wdt:P1365  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 149\n",
      "question: Which U.S. state has the highest population density?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT ?uri { ?uri wdt:P31 wd:Q35657 . ?uri wdt:P1082 ?population . ?uri wdt:P2046 ?area . BIND((?population/?area) AS ?density ) } ORDER BY DESC(?density) LIMIT 1\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q35657 wdt:P150  ?X .  ?X wdt:P1082  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 25\n",
      "question: What is the longest river in China?\n",
      "ref sparql: SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q4022> . ?uri <http://www.wikidata.org/prop/direct/P17> <http://www.wikidata.org/entity/Q148> . ?uri <http://www.wikidata.org/prop/direct/P2043> ?length } ORDER BY DESC(?length) LIMIT 1\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q4022 wdt:P2918  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 50\n",
      "question: What is the highest volcano in Africa?\n",
      "ref sparql:  SELECT DISTINCT ?s1 WHERE { ?s1  <http://www.wikidata.org/prop/direct/P30>  <http://www.wikidata.org/entity/Q15> . ?s1  <http://www.wikidata.org/prop/direct/P31>/<http://www.wikidata.org/prop/direct/P279>*  <http://www.wikidata.org/entity/Q8072> . ?s1 <http://www.wikidata.org/prop/direct/P2044> ?o1 . } ORDER BY DESC(?o1) LIMIT 1\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q15 wdt:P610  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " [{'answer': {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q1394606'}}]\n",
      "\n",
      "id: 39\n",
      "question: Which poet wrote the most books?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q49757 . ?x wdt:P50 ?uri ; wdt:P31 wd:Q571 . } GROUP BY ?uri ORDER BY DESC(COUNT(?x)) LIMIT 1\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q49757 wdt:P50  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 15\n",
      "question: How short is the shortest active NBA player?\n",
      "ref sparql: SELECT DISTINCT ?height WHERE { ?uri <http://www.wikidata.org/prop/direct/P106>  <http://www.wikidata.org/entity/Q3665646> . ?uri <http://www.wikidata.org/prop/direct/P54>/<http://www.wikidata.org/prop/direct/P118> <http://www.wikidata.org/entity/Q155223> .  ?uri <http://www.wikidata.org/prop/P54> ?teamMembership . FILTER NOT EXISTS { ?teamMembership <http://www.wikidata.org/prop/qualifier/P582> ?endDate } ?uri  <http://www.wikidata.org/prop/direct/P2048> ?height } ORDER BY ?height LIMIT 1\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q3665646 wdt:P5109  ?answer  }  \n",
      "ref_answer:\n",
      " [{'height': {'datatype': 'http://www.w3.org/2001/XMLSchema#decimal', 'type': 'literal', 'value': '1.73'}}]\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 189\n",
      "question: In which studio did the Beatles record their first album?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?album wdt:P31 wd:Q482994 ; wdt:P175 wd:Q1299 ; wdt:P577 ?date ; wdt:P483 ?uri . } ORDER BY ?date LIMIT 1\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q482994 wdt:P483  ?X .  ?X wdt:P483 wd:Q1299  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 95\n",
      "question: Who is the youngest player in the Premier League?\n",
      "ref sparql: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?team wdt:P118 wd:Q9448 . ?uri wdt:P54 ?team ; wdt:P569 ?dateOfBirth . } ORDER BY DESC(?dateOfBirth) LIMIT 1\n",
      "pred sparql: select distinct  ?answer where  {  wd:Q9448 wdt:P19  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 87\n",
      "question: Which book has the most pages?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q571 . ?uri wdt:P1104 ?number . } ORDER BY DESC(?number) LIMIT 1\n",
      "pred sparql: SELECT  ?answer WHERE  {  wd:Q571 wdt:P1104  ?X .  ?X wdt:P1104  ?answer  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "id: 148\n",
      "question: What is the largest state in the United States?\n",
      "ref sparql: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q35657 . ?uri wdt:P2046 ?area . } ORDER BY DESC(?area) LIMIT 1\n",
      "pred sparql: select distinct  ?answer where  {   ?answer wdt:P150 wd:Q35657  }  \n",
      "ref_answer:\n",
      " []\n",
      "pred_answer:\n",
      " []\n",
      "\n",
      "0 of 12 predicted queries contain \"ORDER\"\n"
     ]
    }
   ],
   "source": [
    "# check RANK queries\n",
    "count_all = 0\n",
    "count_contains_order = 0\n",
    "\n",
    "for ref, pred in zip(ref_ques_list, pred_ques_list):\n",
    "    ques_pair = Ques_pair(ref, pred)\n",
    "    if ques_pair.type == Type.RANK:\n",
    "        ques_pair.print(print_answer=True)\n",
    "        count_all += 1\n",
    "        if \"ORDER\" in ques_pair.pred_sparql:\n",
    "            count_contains_order += 1\n",
    "\n",
    "print(f'''{count_contains_order} of {count_all} predicted queries contain \"ORDER\"''')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.0"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
